{"nodes": [{"idx": 4, "id": "Alice in Wonderland", "genre": ["family", "sciencefiction/fantasy"], "description": "Troubled by a strange recurring dream and mourning the loss of her father, 19-year-old Alice Kingsleigh attends a garden party at Lord Ascot's estate.  There, she is confronted by an unwanted marriage proposal to Lord Ascot's son, Hamish, and the stifling expectations of the society in which she lives.  Unsure of how to proceed, she pursues a rabbit wearing a blue waistcoat and accidentally falls into a large rabbit hole under a tree..."}, {"idx": 1299, "id": "Alice Through the Looking Glass", "genre": ["sciencefiction/fantasy"], "description": "Chapter One – Looking-Glass House: Alice is playing with a white kitten (whom she calls \"Snowdrop\") and a black kitten (whom she calls \"Kitty\")—the offspring of Dinah, Alice's cat in Alice's Adventures in Wonderland—when she ponders what the world is like on the other side of a mirror's reflection.  Climbing up onto the fireplace mantel, she pokes at the wall-hung mirror behind the fireplace and discovers, to her surprise, that she is able to step through it to an alternative world.  In this reflected version of her own house, she finds a book with looking-glass poetry, \"Jabberwocky\", whose reversed printing she can read only by holding it up to the mirror..."}, {"idx": 12, "id": "Black Swan", "genre": ["action/adventure/thriller"], "description": "Nina Sayers is a 28-year-old dancer in a New York City ballet company, which is preparing to open its new season with Tchaikovsky's Swan Lake.  With prima ballerina Beth MacIntyre being forced into retirement, artistic director Thomas Leroy announces he is looking for a new dancer to portray the dual role of the innocent White Swan and the sensual Black Swan.  Nina auditions for the role and gives a flawless performance as the White Swan, but fails to embody the Black Swan..."}, {"idx": 557, "id": "The Oranges", "genre": ["comedy", "romance"], "description": "The story is narrated from the perspective of aspiring furniture designer Vanessa Walling, (Shawkat) whose plan to stay at home for a few months after college has turned into years.  She makes up increasingly stupid reasons why she does not like all the apartments that her mother and colleagues find online for her. \r\nShe witnesses the heartache between her parents, David and Paige Walling, (Laurie and Keener) as their relationship falls apart from years from sleeping in separate beds and pretending to be happy..."}, {"idx": 15, "id": "The Bounty Hunter", "genre": ["action/adventure/thriller", "comedy"], "description": "Milo Boyd is a former New York Police Department detective who works as a bail enforcement agent (bounty hunter).  Milo's ex-wife, Nicole Hurley, is an investigative reporter who has been arrested for assaulting a police officer. \r\nWhen Nicole receives a tip on a story, an apparent suicide that may have been a murder, she skips her bond hearing to meet her informant, causing the judge to revoke her bail and issue a warrant for her arrest..."}, {"idx": 1070, "id": "The Skeleton Twins", "genre": ["comedy", "drama"], "description": "Milo (Hader) writes a suicide note and cuts his wrists.  Meanwhile, Maggie (Wiig) is in her bathroom preparing to swallow a handful of pills, but is interrupted by a call from a hospital informing her that her brother – whom she hasn't seen in 10 years – has unsuccessfully attempted suicide.  Maggie visits Milo in the hospital in Los Angeles, and suggests that he come to stay with her in their hometown of Nyack, New York for a while; he reluctantly agrees..."}, {"idx": 22, "id": "Charlie St. Cloud", "genre": ["sciencefiction/fantasy", "romance"], "description": "Charlie St.  Cloud is a sailor who wins a boating race on his sailboat, the Splendid Splinter, along with his younger brother Sam.  In 2005, he receives a sailing scholarship to Stanford University..."}, {"idx": 564, "id": "The Perks of Being a Wallflower", "genre": ["drama"], "description": "The film is set against the background of a young student, Charlie (Logan Lerman), who has been suffering from clinical depression from childhood setbacks and has recently been discharged from a mental health care institution to begin his adaptation to a normal lifestyle as a young high school student.  Charlie is uneasy about beginning his freshman year of high school; he is shy and finds difficulty in making friends, but he connects with his English teacher, Mr.  Anderson (Paul Rudd)..."}, {"idx": 25, "id": "Clash of the Titans", "genre": ["action/adventure/thriller", "sciencefiction/fantasy"], "description": "In ancient times, after defeating their predecessors, the Titans, the gods divided the Universe among themselves.  Zeus took the skies, Poseidon took the seas, and Hades was left with the Underworld upon being tricked by Zeus.  The gods created the mortals, whose faith and prayers has fueled the gods' immortality..."}, {"idx": 625, "id": "Wrath of the Titans", "genre": ["action/adventure/thriller", "sciencefiction/fantasy"], "description": "Perseus (Sam Worthington), a son of Zeus (Liam Neeson), lives as a fisherman after the death of his wife, Io (portrayed by Gemma Arterton in the previous film), with his young son, Helius (John Bell).  Zeus visits Perseus and asks for his help, saying that humans are not praying to the gods and as a result the gods are losing their power and becoming mortal.  They can no longer sustain the walls of Tartarus which are crumbling, and the imprisoned Titan Kronos will soon be free..."}, {"idx": 34, "id": "Darkening Sky", "genre": ["action/adventure/thriller"], "description": "The film opens with a childhood \"abduction\" scene, later a memory that the main character (Eric Rainer) flashes back to.  Then we encounter adult Eric in the midst of a panic attack: He stumbles outside and stares up at a \"Darkening Sky\", the stars gradually, impossibly blinking out.  When a neighbor (Harold) interrupts and snaps him out of it, Eric cuts the conversation short and goes back inside, where his girlfriend (Lisa) announces that she is tired of his obsession with Alien Abduction—Eric is laboring on a thesis dismissing UFOs as a \"modern mythology\"—and she breaks up with him..."}, {"idx": 253, "id": "A Good Old Fashioned Orgy", "genre": ["comedy"], "description": "Eric (Jason Sudeikis) is a perpetual adolescent who lives to party, holding lavish theme-events with his friends using his father's large house in the Hamptons.  On July 3, Eric throws a white trash bash party attended by his friends Sue (Michelle Borth), Adam (Nick Kroll), Mike (Tyler Labine), Laura (Lindsay Sloane), Kate (Lucy Punch), Glenn (Will Forte), Doug (Martin Starr) and his girlfriend Willow (Angela Sarafyan), Alison (Lake Bell) and her boyfriend Marcus (Rhys Coiro).  Eric meets Kelly (Leslie Bibb) at the party..."}, {"idx": 39, "id": "Despicable Me", "genre": ["family", "animation"], "description": "Gru, a supervillain, is disheartened when an unknown supervillain steals the Great Pyramid of Giza.  Gru, with the assistance of his colleague Dr.  Nefario and his Minions, resolves to one-up this mystery rival by shrinking and stealing the Moon..."}, {"idx": 707, "id": "Despicable Me 2", "genre": ["family", "animation"], "description": "A mysterious vehicle using a huge magnet steals a highly potent mutagen known as PX-41 from a secret laboratory in the Arctic Circle.  The Anti-Villain League (AVL), headed by Silas Ramsbottom, tries to recruit former supervillain Gru to track down those responsible and recover the mutagen, but Gru refuses, claiming that he is now a legitimate businessman and devoted father to Margo, Edith, and Agnes.  Dr..."}, {"idx": 1435, "id": "Despicable Me 3", "genre": ["action/adventure/thriller", "comedy", "animation"], "description": "Former villain Gru is now an agent for the Anti-Villain League (AVL).  He and his partner/wife Lucy are sent to foil the plans of Balthazar Bratt, a former child actor from the 1980s who has turned evil.  Gru manages to stop Bratt from stealing the world's largest diamond, but is unable to capture him..."}, {"idx": 41, "id": "Diary of a Wimpy Kid", "genre": ["comedy", "family"], "description": "The film starts with Rodrick waking up his brother Greg, saying it is time for school.  However, Rodrick tricks Greg, as it is night.  After the title sequence, Greg attends his first day at middle school and discovers the ups and downs, such as the missing stall doors in the boys' bathroom and the difficulties of obtaining a seat during lunch break..."}, {"idx": 106, "id": "Little Fockers", "genre": ["comedy"], "description": "Five years after the events of the previous film, Gaylord \"Greg\" Focker (Stiller) is preparing to celebrate his twins' fifth-birthday party.  Things seem to go awry when Greg's father-in-law Jack Byrnes (De Niro) visits.  Recently, Jack has been diagnosed with a heart condition and become embittered by his daughter Debbie's divorce from her husband Bob (their marriage was the social event in the first film and how Jack and Greg met), for cheating on her with a nurse..."}, {"idx": 231, "id": "Diary of a Wimpy Kid: Rodrick Rules", "genre": ["comedy", "family"], "description": "The Heffley family attends a party at a roller rink, where Greg Heffley reunites with his best friend Rowley Jefferson, meets a new girl at school named Holly Hills who Greg instantly has a crush on, and reveals he passed on the Cheese Touch.  During the party, his older brother Rodrick embarrasses Greg by suggesting that he ask Holly to skate with him and then interfering with Couples Skate by persuading a crowd of violent teenagers to enter the rink, along with replacing \"Always\" by Atlantic Starr with a heavy metal song.  This prompts Greg's parents (who misunderstand this) to speak to Greg on the rink's public address system and then carry him off the rink..."}, {"idx": 472, "id": "Diary of a Wimpy Kid: Dog Days", "genre": ["comedy"], "description": "The Heffley family attends a pool party at the local pool, where the family meets a former trouble-making friend of Rodrick who is now a model student after attending a military school known as Spag Union.  Greg's father Frank thinks about enrolling Greg there. \r\nGreg's summer starts off badly: Frank bans video games in anger at Greg's laziness, and his mother Susan starts a book club for all the boys in the neighborhood, but she does not see their books as real literature..."}, {"idx": 1411, "id": "Diary of a Wimpy Kid: The Long Haul", "genre": ["comedy", "family"], "description": "One year after the previous film, while at the Corny's family restaurant, the Heffley family plans to attend Meemaw's 90th birthday.  However, after Greg rescues his younger brother Manny, who got stuck inside a tube in the play area, Greg ends up in a ball pit with a diaper stuck on his hand.  He freaks out and started screaming..."}, {"idx": 44, "id": "Due Date", "genre": ["comedy"], "description": "Peter Highman (Robert Downey, Jr. ), a successful architect, is due to fly home from Atlanta to Los Angeles to be with his wife Sarah (Michelle Monaghan), who is about to give birth.  On the way to the airport, he has a chance encounter with Ethan Tremblay (Zach Galifianakis), who is going to LA to be an actor and is planning to scatter his recently deceased father's ashes at the Grand Canyon..."}, {"idx": 1054, "id": "The One I Love", "genre": ["comedy", "romance"], "description": "Confronted with the potential end of their marriage, Ethan (Mark Duplass) and Sophie (Elisabeth Moss) are seeing a therapist (Ted Danson) regularly.  After asking them to each play a note on a piano, he identifies a disconnection in their relationship and suggests they take a weekend retreat to a large, secluded estate.  The couple decides to try anything to save their marriage and agree to go..."}, {"idx": 1344, "id": "A Dog's Purpose", "genre": ["family"], "description": "In the 1950s, a feral puppy named Toby is whisked away to the dog pound and quickly euthanized, wondering if \"fun\" truly is life's purpose. \r\nHis strong spirit is reborn and reincarnated as a newborn Retriever puppy in 1961.  Toby leaves his cage at a puppy mill and is found by two garbage men who plan to sell him for their own profit..."}, {"idx": 45, "id": "Easy A", "genre": ["comedy"], "description": "Olive Penderghast, a 17-year-old girl living in Ojai, California, lies to her best friend Rhiannon Abernathy about going on a date in order to get out of camping with Rhiannon's hippie parents.  Instead, she hangs around the house all weekend listening to Natasha Bedingfield's \"Pocketful of Sunshine\", which is played by a greeting card she was sent by her grandmother.  The following Monday, pressed by Rhiannon, Olive lies about losing her virginity to a college guy..."}, {"idx": 1491, "id": "Professor Marston and the Wonder Women", "genre": ["biography/documentary", "drama"], "description": "The story is told in flashbacks set during a 1945 testimony that William Moulton Marston gives to representatives of the Child Study Association of America.  In the year 1928, William and his wife Elizabeth teach and work on their research at Harvard and Radcliffe Colleges.  One day, William hires one of his students, Olive Byrne (daughter of Ethel Byrne and niece of Margaret Sanger – two famous suffragists and feminists of the 20th century) as a research assistant..."}, {"idx": 47, "id": "The Twilight Saga: Eclipse", "genre": ["sciencefiction/fantasy", "romance"], "description": "In Seattle, not far from Forks, Victoria is still vengeful on Bella for James’s death.  Learning that Laurent is killed by wolves and to replace him and James, she attacks and bites Riley Biers in order to begin creating an army of newborns, who are many times stronger during their first few months than older vampires.  Back in Forks, Edward Cullen and Bella Swan resume their relationship, and discuss the complications of becoming a vampire..."}, {"idx": 211, "id": "The Twilight Saga: Breaking Dawn - Part 1", "genre": ["sciencefiction/fantasy", "romance"], "description": "Bella Swan is preparing for her wedding.  During the reception, Jacob Black returns after hearing about Bella and Edward Cullen's engagement.  While dancing with him in the woods, away from everyone else, Bella admits that she and Edward plan to consummate their marriage on their honeymoon while she's still human..."}, {"idx": 430, "id": "Breaking Wind", "genre": ["comedy"], "description": "One night, a young man named Ronald (Michael Hamilton) is attacked by an unseen assailant, and during the course of the attack he loses his shirt, then one of his teeth, and gains a tattoo.  Finally, he's bitten on his buttocks, which causes him to begin transforming into a vampire and incessantly break wind. \r\nA year later, Bella (Heather Ann Davis) asks her boyfriend Edward Colon (Eric Callero) to transform her into a vampire, but he insists that he marry her first..."}, {"idx": 67, "id": "Grown Ups", "genre": ["comedy"], "description": "In 1978, five childhood friends win their junior high school basketball championship.  Afterwards, they celebrate at a rented lake house.  The friends' coach, Robert Ferdinando (Blake Clark), whom they nickname \"Buzzer\", encourages them to live their lives in a similar way to how they played the game..."}, {"idx": 751, "id": "Grown Ups 2", "genre": ["comedy"], "description": "Three years after the events of the first film, Lenny Feder has relocated his family back to his Connecticut hometown of Stanton where he and his friends grew up. \r\nIn the film's opening in the Feder household, Lenny wakes up to find a wild deer standing next to his bed.  Lenny tries to get his wife Roxanne to open the window..."}, {"idx": 69, "id": "Harry Potter and the Deathly Hallows: Part 1", "genre": ["action/adventure/thriller", "sciencefiction/fantasy"], "description": "Minister of Magic Rufus Scrimgeour addresses the wizarding media, and states that the Ministry will remain strong, even as Lord Voldemort gains strength.  The Death Eaters have made major gains after Dumbledore's death, committing mass killings of Muggles and infiltrating the Ministry itself.  Harry, Ron, and Hermione set out to complete the mission Dumbledore gave Harry by hunting down and destroying Voldemort's Horcruxes..."}, {"idx": 262, "id": "Harry Potter and the Deathly Hallows: Part 2", "genre": ["action/adventure/thriller", "sciencefiction/fantasy"], "description": "After burying Dobby, Harry Potter asks the goblin Griphook to help him, Ron, and Hermione break into Bellatrix Lestrange's vault at Gringotts bank, suspecting a Horcrux may be there.  Griphook agrees, in exchange for the Sword of Gryffindor.  Wandmaker Ollivander tells Harry that two wands taken from Malfoy Manor belonged to Bellatrix and to Draco Malfoy, but Malfoy's has changed its allegiance to Harry..."}, {"idx": 72, "id": "Hot Tub Time Machine", "genre": ["comedy", "sciencefiction/fantasy"], "description": "Three estranged, depressed friends: Adam Yates is dumped by his girlfriend; Nick Webber-Agnew is a henpecked husband with a dead-end job; and Lou Dorchen is a party animal in his 40s.  They reconnect when Lou is hospitalized for carbon monoxide poisoning.  To cheer him up, Adam and Nick arrange for Lou to join them at Kodiak Valley Ski Resort, where the three enjoyed fun times in their youth; Adam's reclusive nephew Jacob tags along..."}, {"idx": 1148, "id": "Hot Tub Time Machine 2", "genre": ["comedy"], "description": "Five years after the events of the first film, Lou Dorchen and Nick Webber have become rich and famous, with Lou becoming a multi-billionaire and Nick being a successful music singer.  At Lou's celebratory party, Lou is shot in the groin.  Jacob (Lou's son) and Nick drag him to the hot tub time machine and activate it in order to travel back in time to find and stop the killer..."}, {"idx": 74, "id": "How to Train Your Dragon", "genre": ["family", "sciencefiction/fantasy"], "description": "The Isle of Berk is a remote Viking village, from which dragons periodically steal livestock.  Hiccup, the awkward fifteen-year-old son of the village chieftain, Stoick the Vast, is too small to fight the dragons and instead fashions mechanical devices under his apprenticeship with Gobber the blacksmith, though his inventions often backfire.  During one attack, Hiccup believes he has shot down a Night Fury, an extremely rare and dangerous dragon..."}, {"idx": 1018, "id": "How to Train Your Dragon 2", "genre": ["sciencefiction/fantasy"], "description": "Five years after the Viking village of Berk and the dragons made peace, they now live together in harmony.  Hiccup goes on adventures with his dragon, Toothless, as they discover and map unexplored lands.  Now 20 years old, he is being pressed by his father, Stoick the Vast, to succeed him as chieftain, although Hiccup remains unsure if he is ready for this responsibility..."}, {"idx": 79, "id": "Iron Man 2", "genre": ["action/adventure/thriller"], "description": "In Russia, the media covers Tony Stark's disclosure of his identity as Iron Man.  Ivan Vanko, whose father Anton Vanko has just died, sees this and begins building a miniature arc reactor similar to Stark's.  Six months later,[N 2] Stark is a superstar and uses his Iron Man suit for peaceful means, resisting government pressure to sell his designs..."}, {"idx": 784, "id": "Iron Man 3", "genre": ["action/adventure/thriller"], "description": "At a New Year's Eve party in 1999, Tony Stark meets scientist Maya Hansen, the inventor of experimental regenerative treatment Extremis that allows recovery from crippling injuries.  Disabled scientist Aldrich Killian offers them a place in his company Advanced Idea Mechanics, but Stark rejects him.  Thirteen years later, Stark is having panic attacks due to his experiences during the alien invasion and subsequent Battle of New York..."}, {"idx": 80, "id": "It's Kind of a Funny Story", "genre": ["comedy", "drama"], "description": "After contemplating suicide by jumping off the Brooklyn Bridge, 16-year-old Craig Gilner decides to go to the hospital to seek help.  Craig tells Dr.  Mahmoud that he needs immediate help to which Dr..."}, {"idx": 976, "id": "Cheap Thrills (film)", "genre": ["comedy"], "description": "Craig (Pat Healy) is an auto mechanic who loses his job.  He is unable to pay his rent and after seeing the eviction sign, he goes to a dive bar, where he meets an old friend from high school, Vince (Ethan Embry).  After their reunion, they meet a rich couple, Colin and Violet (David Koechner and Sara Paxton), who appear friendly and benign initially, and after becoming aware of Craig's dire financial situation, offer them money in return for completing certain tasks to entertain Violet, as it is her birthday..."}, {"idx": 88, "id": "Kick-Ass", "genre": ["action/adventure/thriller"], "description": "Dave Lizewski is an ordinary teenager who lives in Staten Island, New York.  Inspired by comic books, Dave plans to become a real-life superhero.  He purchases and modifies a scuba diving suit, and arms himself with batons..."}, {"idx": 799, "id": "Kick-Ass 2", "genre": ["action/adventure/thriller", "comedy"], "description": "Dave Lizewski, bored after having retired from fighting crime as Kick-Ass, begins training with Hit-Girl Mindy Macready to become a real hero.  Following the death of his father, Chris D'Amico accidentally kills his own mother by short-circuiting her tanning bed; she had been in denial about her husband's death.  Now in control of his father's criminal empire, Chris finds a fetishwear outfit, adopts two of his father's handguns and decides to become a supervillain The Motherfucker, swearing vengeance on Kick-Ass..."}, {"idx": 90, "id": "The Killer Inside Me", "genre": ["action/adventure/thriller", "drama"], "description": "In 1952, Deputy Sheriff Lou Ford (Casey Affleck) is a pillar of the community in his small west Texas town — patient, dependable, and well-liked.  However, he is a sociopath with violent sexual tastes.  As a teenager, Lou was caught raping a five-year-old girl by his adopted brother Mike, who pleaded guilty to the crime and served prison time to protect Lou..."}, {"idx": 1091, "id": "Nightcrawler", "genre": ["action/adventure/thriller"], "description": "Petty thief Louis \"Lou\" Bloom (Jake Gyllenhaal) is caught stealing from a Los Angeles construction site by a security guard.  He attacks the guard, steals his watch and leaves with the stolen material.  After selling the material at a scrap yard, Lou asks for a job, but the foreman says he does not hire thieves..."}, {"idx": 95, "id": "The Last Exorcism", "genre": ["horror/mystery"], "description": "Reverend Cotton Marcus (Patrick Fabian) lives in Baton Rouge, Louisiana with his wife and son.  Marcus, who lost his faith after the birth of his ill son, is accustomed to performing fake exorcisms on \"possessed\" individuals.  He chooses an exorcism request sent by farmer Louis Sweetzer (Louis Herthum), who claims his livestock are being slaughtered by his daughter Nell (Ashley Bell), who is possessed..."}, {"idx": 807, "id": "The Last Exorcism Part II", "genre": ["horror/mystery"], "description": "A couple, Jared (Judd Lormand) and Lily (Boyana Balta), finds a demonic-looking Nell Sweetzer (Ashley Bell) squatting next to their refrigerator.  She soon is taken to a hospital, where she appears to be catatonic.  After spending a few months at the insightful and caring therapist Frank's (Muse Watson) home for girls in New Orleans and settling in as a chambermaid at a hotel under the supervision of her boss Beverly (Diva Tyler), Nell's condition seems to have improved and she no longer has \"bad dreams\"..."}, {"idx": 102, "id": "Letters to God", "genre": ["drama"], "description": "Tyler Doherty (Tanner Maguire) is an 8-year-old suffering from cancer who has a love for writing and sending letters to Jesus.  His local postman, Walter Finley (Christopher Schmidt), takes them to his office after work.  His boss sees them and instructs Walter to take care of them..."}, {"idx": 141, "id": "Remember Me", "genre": ["drama", "romance"], "description": "At New York City in 1991, Alyssa \"Ally\" Craig is waiting with her mother for the subway, when they are mugged by two young men, who shoot her mother after boarding the train. \r\nTen years later, Ally is a student at New York University, and lives with her father, Neil, a New York Police Department detective.  Tyler Hawkins audits classes at NYU, and works at the university bookstore..."}, {"idx": 1207, "id": "Me and Earl and the Dying Girl", "genre": ["comedy", "drama"], "description": "Awkward, lanky, and self-loathing, Greg Gaines (Thomas Mann) is a senior at Pittsburgh's Schenley High School who appears to drift through life while only seeming to broadly associate himself with the various cliques within Schenley's halls.  He learns that a fellow student and former childhood friend of his, Rachel Kushner (Olivia Cooke), has been diagnosed with leukemia and is forced by his parents (Nick Offerman and Connie Britton) to befriend her in her time of need.  Despite neither of them truly wanting the other's company, Greg manages to strike up a conversation about her pillow collection..."}, {"idx": 109, "id": "Love & Other Drugs", "genre": ["comedy", "drama"], "description": "In 1996, Jamie Randall is fired from a Pittsburgh electronics store for having sex with his manager's girlfriend.  His wealthy brother Josh announces at the dinner table at their parents' house that he has found Jamie a job as a pharmaceutical sales representative.  After attending a Pfizer training program where he has sex with the instructor, Jamie goes to work for the company and tries to get doctors to prescribe Zoloft and Zithromax..."}, {"idx": 247, "id": "Friends with Benefits", "genre": ["comedy", "romance"], "description": "Jamie Rellis (Mila Kunis) is an executive recruiter for a leading job agency in New York City, and Dylan Harper (Justin Timberlake) works as an art director for a small internet company in Los Angeles.  Jamie has the task of trying to recruit Dylan to interview for a job with GQ and begin working in New York City.  Dylan comes to New York and after interviewing for the position learns from Jamie that he has been given an offer to work for GQ..."}, {"idx": 111, "id": "Machete", "genre": ["action/adventure/thriller"], "description": "Mexico: Machete Cortez (Danny Trejo), a former Mexican Federal and his younger partner are on a mission to rescue a kidnapped girl (Mayra J.  Leal).  During the operation, his partner is killed, the kidnapped girl stabs him before being killed herself, and Machete is betrayed by his corrupt Chief to the powerful drug lord, Rogelio Torrez (Steven Seagal), who kills Machete's wife and implies that he will kill his daughter before leaving him for dead..."}, {"idx": 821, "id": "Machete Kills", "genre": ["action/adventure/thriller"], "description": "Machete Cortez (Danny Trejo) and Sartana Rivera (Jessica Alba) attempt to capture weapon dealers who have been supplying the Mexican drug cartels.  The military men are then all killed by the gangsters, who in turn are wiped out by another intervening party.  Its leader murders Sartana while Machete is arrested by corrupt Sheriff Doakes (William Sadler) and Deputy Clebourne (Samuel Davis)..."}, {"idx": 122, "id": "The Next Three Days", "genre": ["action/adventure/thriller"], "description": "Lara Brennan (Elizabeth Banks) is wrongly convicted of murdering her boss and is sentenced to life in prison.  Her young son Luke[6] ceases to acknowledge her during prison visits.  Following the failure of her appeal, her attorney balks at her acquittal..."}, {"idx": 646, "id": "Apartment 1303 3D", "genre": ["horror/mystery"], "description": "Following a family dispute, Janet moves out of the home she shares with her older sister, Lara and their single mother, Maddie.  She moves into apartment 1303 on the thirteenth floor of a downtown Detroit apartment building.  A 9-year-old neighbor, Emily, explains to Janet that a previous occupant of her new apartment killed herself..."}, {"idx": 128, "id": "Paranormal Activity 2", "genre": ["horror/mystery"], "description": "August 2006, a \"burglary\" occurs at the home of Kristi (Sprague Grayden) and Daniel Rey (Brian Boland).  The entire house is trashed except for their infant son Hunter's bedroom.  Daniel installs security cameras throughout the house after the vandalism, which capture many strange occurrences..."}, {"idx": 310, "id": "Paranormal Activity 3", "genre": ["horror/mystery"], "description": "In 2005, Katie delivers a box of old videotapes to her pregnant sister Kristi and her husband Daniel, which holds footage of young Katie and Kristi with their mother, Julie, and her boyfriend Dennis.  A year later, Kristi and Daniel's house is ransacked and the tapes are missing. \r\nIn 1988, a young Katie and Kristi are living with their mother Julie and her boyfriend Dennis..."}, {"idx": 129, "id": "Passion Play", "genre": ["drama"], "description": "Nate (Mickey Rourke), a small-time jazz musician and recovering heroin addict, is clearly a hard-luck case.  After a performance one night, he is mugged and bound.  He awakens to find himself in a vehicle and being driven out into the desert, but he is helpless to do anything about it..."}, {"idx": 990, "id": "Kid Cannabis", "genre": ["comedy", "drama"], "description": "Nate Norman (Jonathan Daniel Brown) lives in Coeur d’Alene, Idaho with his younger brother and their single mom who works multiple jobs to support them.  An eighteen-year-old high school dropout, Nate smokes copious amounts of marijuana with his best friend Topher Clark (Kenny Wormald), a 27-year-old who had moved from Boston.  The two become increasingly fed up at being nobodies scraping to get by in a city of wealth..."}, {"idx": 130, "id": "Percy Jackson & the Olympians: The Lightning Thief", "genre": ["action/adventure/thriller", "family"], "description": "In New York City, Zeus and Poseidon meet at the top of the Empire State Building, where Zeus reveals that his master lightning bolt has been stolen and accuses Poseidon's demigod son, Percy Jackson, of the theft.  Poseidon reminds him that Percy is unaware of his true identity, but Zeus declares that unless his master bolt is returned to Mount Olympus before the summer solstice, in two weeks' time, war will be waged between all the gods. \r\nPercy is a 16-year-old boy who appears to his peers to be dyslexic and has a unique ability to stay underwater for a long time..."}, {"idx": 852, "id": "Percy Jackson: Sea of Monsters", "genre": ["action/adventure/thriller", "sciencefiction/fantasy"], "description": "While in Camp Half-Blood, Percy recounts the story of Thalia and her sacrifice.  A young Annabeth, Luke, Grover and Thalia are running to Camp Half-Blood while being pursued by monsters.  Thalia sacrifices herself to get the others into the camp, and her father Zeus transforms her into a pine tree, creating a magical border around the camp..."}, {"idx": 137, "id": " Rabbit Hole", "genre": ["drama"], "description": "Becca and Howie Corbett's four-year-old son Danny is killed in a car accident after he runs out into the street after his dog.  Becca wants to give away Danny's clothes, remove Danny's things, and sell their house, but Howie is angry at Becca's elimination of anything that reminds them of their child.  Howie also wants to have another child with Becca, but she refuses..."}, {"idx": 176, "id": "Vampires Suck", "genre": ["comedy"], "description": "Becca Crane (Jenn Proske) moves to Sporks to live with her clueless father, Sheriff Frank (Diedrich Bader), after her mother starts an affair with Tiger Woods.  Meanwhile, a killing spree targeting random locals is attributed to the Canadians, but the real perpetrators are a group of vampires usually mistaken for the Black Eyed Peas.  Becca quickly befriends many students at her new high school, including Jennifer (Anneliese van der Pol)..."}, {"idx": 138, "id": "Ramona and Beezus", "genre": ["comedy", "family"], "description": "The adventurous and creative third-grader Ramona Quimby (Joey King) often finds herself in trouble at school and at home, usually with her best friend, Howie (Jason Spevack).  When her father Robert (John Corbett) loses his job and the family falls into severe debt, Ramona's efforts to earn money end up backfiring in humorous ways.  She repeatedly embarrasses her older sister, Beatrice (Selena Gomez), calling her by her family nickname, \"Beezus\", in front of Beatrice's crush, the paperboy Henry Huggins (Hutch Dano)..."}, {"idx": 150, "id": "Scott Pilgrim vs. the World", "genre": ["action/adventure/thriller", "comedy", "romance"], "description": "In Toronto, 23-year-old Scott Pilgrim is a bassist in Sex Bob-Omb, a floundering garage band.  To the disapproval of his friends, he is dating Knives Chau, a 17-year-old high-school student.  Scott meets an American Amazon delivery girl, Ramona Flowers, having first seen her in a dream, and loses interest in Knives, but doesn't break up with her before pursuing Ramona..."}, {"idx": 140, "id": "Red", "genre": ["action/adventure/thriller", "comedy"], "description": "Frank Moses, retired black-ops CIA agent, lives alone in Cleveland, Ohio.  Lonely, Frank often chats on the phone with Sarah Ross, a worker at the General Services Administration's pension office in Kansas City, Missouri.  He creates opportunities to talk to her by tearing up his pension checks and calling her to say they had never arrived..."}, {"idx": 867, "id": "RED 2", "genre": ["action/adventure/thriller", "comedy"], "description": "Three years after the previous film, while trying to lead a normal life with girlfriend Sarah Ross, Frank Moses is approached by Marvin Boggs, who claims people are still after them, but Frank dismisses him.  After appealing a second time, Marvin drives off, and his car explodes.  Although Frank does not believe Marvin is dead, Sarah convinces him to go to Marvin's funeral where he delivers a teary-eyed eulogy..."}, {"idx": 143, "id": "Resident Evil: Afterlife", "genre": ["action/adventure/thriller", "sciencefiction/fantasy", "horror/mystery"], "description": "One year after the events of Extinction, Alice (Milla Jovovich) and her clones lead the assault to attack Umbrella HQ, located in Tokyo, slaying the entire branch except for Albert Wesker (Shawn Roberts), who escapes in a tiltrotor plane and detonates a bomb that leaves a massive sinkhole.  The real Alice boarded beforehand and attempts to execute Wesker, only for him to inject her with an anti-virus to remove her superhuman abilities.  Wesker is revealed to have used the T-Virus to gain his own superhuman abilities and prepares to kill Alice, before the autopilot crashes the plane into the mountains and only Alice survives..."}, {"idx": 579, "id": "Resident Evil: Retribution", "genre": ["action/adventure/thriller", "sciencefiction/fantasy"], "description": "Alice and the others on the Umbrella Corporation freighter Arcadia, now face an attack by an assaulting fleet of tiltrotor V-22 Ospreys led by Alice's former ally, Jill Valentine, resulting in the killing of many of the survivors in the ship.  Alice is captured during the attack while the fates of Chris Redfield, Claire Redfield and K-Mart are left ambiguous. \r\nThe story switches to a suburban Alice living with her husband, Todd, and her deaf daughter Becky..."}, {"idx": 1345, "id": "Resident Evil: The Final Chapter", "genre": ["action/adventure/thriller", "sciencefiction/fantasy", "horror/mystery"], "description": "Dr.  James Marcus, the original founder of the Umbrella Corporation, had a daughter who was dying of premature aging.  Desperate to save her, Marcus discovered the T-virus..."}, {"idx": 152, "id": "Sex and the City 2", "genre": ["comedy", "romance"], "description": "Carrie, Samantha, Charlotte, and Miranda meet up.  In flashback Carrie is depicted arriving in New York City in 1986, then met Charlotte in 1987, Miranda in 1989.  She also meets Samantha, when she was a bartender at the music club CBGB..."}, {"idx": 686, "id": "Carrie", "genre": ["horror/mystery"], "description": "Alone in her home, Margaret White, a disturbed religious fanatic, gives birth to a baby girl, intending to kill the infant but changes her mind.  Years later, her daughter Carrie, a shy, unassertive girl, nears her graduation from Ewen High School in Maine. \r\nWhile showering after gym class at school, Carrie experiences her first menstrual period, then naively thinks she is bleeding to death..."}, {"idx": 180, "id": "What's Wrong with Virginia", "genre": ["drama"], "description": "In a small town, mentally unstable Virginia has a two-decade affair with a local married sheriff, Dick Tipton.  Her son Emmett (Harrison Gilbertson) acts as her protector. [1] During Emmett's quest for the truth of his father's identity, he begins a relationship with Tipton's daughter Jessie..."}, {"idx": 619, "id": "Virginia", "genre": ["drama"], "description": "In a small town, mentally unstable Virginia has a two-decade affair with a local married sheriff, Dick Tipton.  Her son Emmett (Harrison Gilbertson) acts as her protector. [1] During Emmett's quest for the truth of his father's identity, he begins a relationship with Tipton's daughter Jessie..."}, {"idx": 192, "id": "50/50", "genre": ["comedy", "drama"], "description": "Adam Lerner (Joseph Gordon-Levitt) is a 27-year-old public radio journalist in Seattle with girlfriend and artist Rachael (Bryce Dallas Howard) of whom best friend and co-worker Kyle (Seth Rogen) disapproves.  While Kyle is brash and outspoken, Adam is more introverted and mild-mannered. \r\nAfter experiencing harsh pains in his back, Adam is diagnosed with schwannoma neurofibrosarcoma, a malignant tumor in his spine, and must undergo chemotherapy..."}, {"idx": 307, "id": "No Strings Attached", "genre": ["comedy", "romance"], "description": "After first meeting at a summer camp as teenagers, Emma (Natalie Portman) and Adam (Ashton Kutcher) run into each other a few times as young adults but never keep in touch.  Emma becomes a doctor in Los Angeles, Adam a production assistant for a musical television show.  Adam's father Alvin (Kevin Kline), the well-known star of a former hit television comedy series, has begun a romance with Adam's ex-girlfriend, Vanessa (Ophelia Lovibond)..."}, {"idx": 203, "id": "Atlas Shrugged: Part I", "genre": ["action/adventure/thriller", "drama"], "description": "In 2016, the United States is in a sustained economic depression.  Industrial disasters, resource shortages, and gasoline prices at $37 per gallon have made railroads the primary mode of transportation, but even they are in disrepair.  After a major accident on the Rio Norte line of the Taggart Transcontinental railroad, CEO James Taggart shirks responsibility..."}, {"idx": 398, "id": "Atlas Shrugged: Part II", "genre": ["drama", "horror/mystery"], "description": "Dagny Taggart pilots an airplane in pursuit of another plane.  Dagny asks herself, \"Who is John Galt?\" before apparently crashing into a mountainside. \r\nNine months earlier, Dagny is trying to understand the abandoned prototype of an advanced motor she and her lover Hank Rearden have found..."}, {"idx": 214, "id": "Captain America: The First Avenger", "genre": ["action/adventure/thriller"], "description": "In the present day, scientists in the Arctic uncover an old, frozen aircraft.  In March 1942, Nazi officer Johann Schmidt and his men steal a mysterious relic called the Tesseract,[N 2] which possesses untold powers, from the town of Tønsberg in German-occupied Norway. \r\nIn New York City, Steve Rogers is rejected for World War II military recruitment because of various health and physical problems..."}, {"idx": 982, "id": "Captain America: The Winter Soldier", "genre": ["action/adventure/thriller"], "description": "Two years after the Battle of New York,[N 1] Steve Rogers works in Washington, D. C.  for the espionage agency S..."}, {"idx": 234, "id": "Dolphin Tale", "genre": ["drama", "family"], "description": "Sawyer Nelson, a lonely 11-year-old boy, has fallen behind in school since being abandoned by his father five years earlier.  His only friend is his cousin Kyle, a champion swimmer who hopes to compete in the Olympics.  Kyle leaves to spend time in the army..."}, {"idx": 1063, "id": "Dolphin Tale 2", "genre": ["drama"], "description": "Three years after saving Winter, Sawyer, now aged fourteen, gets a chance for a scholarship to the elite SEA Semester program, which involves three months at sea doing marine mammal research, after impressing his cousin Kyle's advisor Dr.  Miguel Arroyo when champian surfer Bethany Hamilton swims with him and Winter.  Sawyer is reluctant to go because he is concerned about leaving Winter..."}, {"idx": 240, "id": "Dylan Dog: Dead of Night", "genre": ["action/adventure/thriller", "comedy", "horror/mystery"], "description": "In New Orleans, Dylan Dog, an ace detective whose specialty is paranormal cases, narrates how he helped people with their cases until his wife, Cassandra, was killed by vampires.  Since then he has been doing regular cases with his \"partner\", Marcus Deckler. \r\nOne night, when teenager Elizabeth Ryan calls her father, without getting an answer, she goes to her father's room and finds him dead on the floor..."}, {"idx": 1439, "id": "2:22", "genre": ["action/adventure/thriller", "drama"], "description": "The movie starts with Dylan Branson (Michiel Huisman) having a dream about a murder at the Grand Central Train Station that feels very real.  He wakes with a start and progresses with his routine while watching news about a star called Hamlin that died 30 years ago, but its light is reaching the Earth 30 years later and that this supernova will have effects on the Earth and its inhabitants.  Dylan is an air traffic controller who possess a unique ability to visualize patterns..."}, {"idx": 242, "id": "Everything Must Go", "genre": ["comedy", "drama"], "description": "Salesman Nick Halsey (Will Ferrell) is fired from his job of 16 years following an unspecified incident in Denver related to his alcoholism.  He sits in the parking garage after leaving the office, drinking from a flask.  He then takes the Swiss Army Knife he was given as a farewell gift and stabs it into his supervisor's car tires, only to leave the knife (which has his name on it) and run away when he is unable to pull it back out from the tire..."}, {"idx": 630, "id": "12 Rounds 2: Reloaded", "genre": ["action/adventure/thriller"], "description": "Paramedic Nick Malloy and his wife Sarah are going home after a movie, when an accident occurs.  Nick attempts to aid and rescue the victims: a young boy and a wife and husband.  Despite Nick's efforts, the wife dies; this shatters Nick completely as it never happened in his career..."}, {"idx": 244, "id": "Fast Five", "genre": ["action/adventure/thriller"], "description": "When Dominic \"Dom\" Toretto is being transported to Lompoc Prison by bus, his sister Mia Toretto and friend Brian O'Conner lead an assault on the bus, causing it to crash and freeing Dom.  While the authorities search for them, the trio escapes to Rio de Janeiro.  Awaiting Dom's arrival, Mia and Brian join their friend Vince and other participants on a job to steal three cars from a train..."}, {"idx": 726, "id": "Fast & Furious 6", "genre": ["action/adventure/thriller"], "description": "Following their successful heist in Brazil, Dominic \"Dom\" Toretto and his professional criminal crew have fled around the world: Dom lives with Elena; his sister Mia lives with Brian O'Conner and their son, Jack; Gisele and Han live together; and Roman and Tej live in luxury.  Meanwhile, DSS agent Luke Hobbs and Riley Hicks investigate the destruction of a Russian military convoy by a crew led by former British SAS Major and special ops soldier Owen Shaw.  Hobbs persuades Dom to help capture Shaw by showing him a photo of the supposedly long-dead Letty Ortiz, Dom's former lover..."}, {"idx": 1174, "id": "Furious 7", "genre": ["action/adventure/thriller"], "description": "After defeating Owen Shaw and his crew and securing amnesty for their past crimes,[N 1] Dominic \"Dom\" Toretto, Brian O'Conner and the rest of their team have returned to the United States to live normal lives again.  Brian begins to accustom himself to life as a father, while Dom tries to help Letty Ortiz regain her memory.  Meanwhile, Owen's older brother, Deckard Shaw, breaks into the secure hospital that the comatose Owen is being held in and swears vengeance against Dom and his team, before breaking into Luke Hobbs' Diplomatic Security Service (DSS) office to extract profiles of Dom's crew..."}, {"idx": 1391, "id": "The Fate of the Furious", "genre": ["action/adventure/thriller"], "description": "Dominic \"Dom\" Toretto and Letty Ortiz are on their honeymoon in Havana when Dom's cousin Fernando gets in trouble owing money to local racer Raldo.  Sensing Raldo is a loan shark, Dom challenges Raldo to a race, pitting Fernando's reworked car against Raldo's, and wagering his own show car.  After narrowly winning the race, Dom allows Raldo to keep his car, earning his respect, and instead leaves his cousin with his show car..."}, {"idx": 248, "id": "Fright Night", "genre": ["comedy", "horror/mystery"], "description": "Charley Brewster is a teenager living in a suburb of Las Vegas, Nevada, who discovers that a new neighbor has moved in next door.  Charley's old best friend, Edward \"Evil Ed\" Lee, informs him that many students have gone missing, including their other childhood friend, Adam Johnson.  When Charley goes home after school, his mother, Jane, introduces him to Jerry Dandrige, their new neighbor..."}, {"idx": 732, "id": "Fright Night 2: New Blood", "genre": ["comedy", "horror/mystery"], "description": "Charley Brewster, Ed Bates and Amy Peterson are with their class as exchange students in Romania, where Charley tries to reconcile with Amy after she suspects him of cheating.  On their first night in the hotel, Charley spots a woman biting another woman in the residence across the road.  That woman is revealed later that night to be Gerri Dandridge, the college professor who will be teaching them about Romanian history and culture..."}, {"idx": 258, "id": "The Hangover: Part II", "genre": ["comedy"], "description": "Two years after the events of the first movie in Las Vegas, Stu Price, Phil Wenneck, Alan Garner and Doug Billings travel to Thailand to celebrate Stu's upcoming wedding to Lauren.  Much to Alan's dismay, they are joined by Lauren's younger brother, Teddy.  At the rehearsal dinner, Lauren's father reveals his disapproval of Stu during a toast..."}, {"idx": 753, "id": "The Hangover Part III", "genre": ["comedy"], "description": "Two years after the events in Bangkok, Leslie Chow (Ken Jeong) escapes from a maximum security prison, using a riot as cover.  Meanwhile, in the United States, Alan Garner (Zach Galifianakis) causes a multi-car freeway pileup after he purchases a giraffe and accidentally decapitates it on a low overpass.  Alan's father Sid (Jeffrey Tambor), angry with Alan for his immature antics and never owning up to his mistakes, dies of a heart attack in the middle of a lecture..."}, {"idx": 277, "id": "Insidious", "genre": ["horror/mystery"], "description": "Married couple Josh and Renai Lambert, their children Dalton, Foster, and infant daughter Cali have recently moved into a new home.  One night, Dalton is drawn to the attic when he hears creaking noises and sees the door open by itself.  He falls from a ladder while investigating and sees a figure in the shadows..."}, {"idx": 782, "id": "Insidious: Chapter 2", "genre": ["horror/mystery"], "description": "In 1986, Lorraine Lambert summons demonologist Elise Rainier to help her son Josh, who is being followed by the spirit of an old woman.  After investigating the house and encountering paranormal phenomena, Elise tells Lorraine that they must suppress Josh's astral projection abilities for his own safety. \r\nTwenty-five years later, Renai Lambert is under questioning about the death of Elise..."}, {"idx": 279, "id": "Jack and Jill", "genre": ["comedy"], "description": " Homemade videos show fraternal twins Jack and Jill Sadelstein growing up in New York City.  Jack is the gifted twin, while Jill constantly tries—and fails miserably—to get his attention by injuring him and/or driving others away from him. \r\nIn present-day Los Angeles, Jack is a successful advertising executive who lives with his beautiful wife Erin and their two kids: Sofia/Sofie and Gary, a Hindu child they adopted at birth..."}, {"idx": 509, "id": "Gone", "genre": ["action/adventure/thriller"], "description": "Jillian \"Jill\" Conway (Amanda Seyfried) lives in Portland, Oregon with her sister Molly (Emily Wickersham), a college student.  Much earlier, Jill was kidnapped by a brutal serial killer who put her in a deep vertical hole somewhere in Portland's 5,100-acre Forest Park.  Jill found human remains, used one of the bones to stab her abductor, and escaped from the hole, using his rope ladder..."}, {"idx": 286, "id": "Kung Fu Panda 2", "genre": ["family", "animation"], "description": "Lord Shen, the scion of a peacock clan that rules Gongmen City in ancient China, seeks to weaponize gunpowder, which had recently been invented to create fireworks.  After discovering from the court's goat soothsayer that \"a warrior of black-and-white\" will defeat him if he does not change his ways, Shen leads an army of wolves to exterminate the panda population to avert the prophecy.  Shen's parents are horrified at this atrocity and exile their son, who swears revenge..."}, {"idx": 1246, "id": "Kung Fu Panda 3", "genre": ["action/adventure/thriller", "comedy", "animation"], "description": "In the spirit realm, Oogway fights against an adversary named Kai, who has defeated other kung fu masters in the realm and taken their chi.  Oogway willingly gives in and also has his chi stolen, but not before warning Kai that the Dragon Warrior, Po, will stop him.  Kai takes this as a challenge to steal the Dragon Warrior's chi and returns to the mortal realm..."}, {"idx": 296, "id": "Mars Needs Moms", "genre": ["comedy", "sciencefiction/fantasy", "animation"], "description": "Unbeknownst to humans, there is a thriving, technologically sophisticated society of Martians living below the surface of Mars.  The Martians Supervisor (Mindy Sterling), while observing Earth, sees a mother (Joan Cusack) persuading her pre-teenage son, Milo (motion by Seth Green, voice by Seth Dusky), to do his chores.  The Martians decide to bring her to Mars, where her \"momness\" will be extracted and implanted into the next generation of nannybots..."}, {"idx": 304, "id": "The Muppets", "genre": ["comedy", "musical"], "description": "Brothers Walter and Gary, residents of Smalltown, are fans of the Muppets, having watched The Muppet Show throughout their youth.  Now adults, Gary plans a vacation to Los Angeles with his girlfriend, Mary, to celebrate their tenth anniversary, inviting Walter so he can tour the Muppet Studios.  Mary feels Gary's devotion to Walter is detracting from their relationship..."}, {"idx": 978, "id": "Muppets Most Wanted", "genre": ["comedy"], "description": "Following the events of the previous film, The Muppets find themselves at a loss as to what to do until Dominic Badguy suggests the Muppets go on a European tour with him as their tour manager.  As the Muppets begin their tour, a criminal mastermind named Constantine, a near-exact double for Kermit the Frog in appearance, escapes from a Siberian Gulag and joins his subordinate Dominic to begin a plot to steal the Crown Jewels of the United Kingdom. \r\nOnce the Muppets arrive in Berlin, Germany, Dominic secures them a show at a prestigious venue..."}, {"idx": 325, "id": "Rio", "genre": ["family", "animation"], "description": "In Brazil, various exotic birds are smuggled out of the country.  In Moose Lake, Minnesota, a crate with a male Spix's macaw hatchling falls out of a truck and is found by a little girl named Linda Gunderson, who names him Blu.  Over the next 15 years,[7] Linda comes to own a bookstore..."}, {"idx": 987, "id": "Rio 2", "genre": ["animation"], "description": "Spix's Macaws Blu and Jewel and their three children—Bia, Carla, and Tiago—are living happily in the city until Jewel realizes that her children are becoming more like humans.  Meanwhile, Blu's former owner, Linda Gunderson and her ornithologist husband, Tulio are on an expedition in the Amazon and, after a fall down a waterfall, discover a quick-flying Spix's macaw that loses one of its feathers.  When word gets out about this through television, Jewel believes that they should go to the Amazon to help find the blue macaws..."}, {"idx": 326, "id": "Rise of the Planet of the Apes", "genre": ["sciencefiction/fantasy"], "description": "Will Rodman, a scientist at the San Francisco biotech company Gen-Sys, is testing the viral-based drug ALZ-112 on chimpanzees to find a cure for Alzheimer's disease.  ALZ-112 is given to a chimp named Bright Eyes, greatly increasing her intelligence.  But then, during Will's presentation for the drug, Bright Eyes is forced from her cage, goes on a rampage, and is shot to death..."}, {"idx": 1030, "id": "Dawn of the Planet of the Apes", "genre": ["sciencefiction/fantasy"], "description": "Ten years after the pandemic of the deadly ALZ-113 virus, later called Simian Flu, the worldwide human population was drastically reduced, with only about one in five hundred genetically immune to the virus.  Meanwhile, the apes, under the chimpanzee Caesar, all bestowed with genetically enhanced intelligence by the virus, have long established a colony in the Muir Woods near San Francisco. \r\nOne day, a group of humans led by a man named Malcolm enter the apes' territory from San Francisco in search of a hydroelectric dam that would restore power to the city..."}, {"idx": 1442, "id": "War for the Planet of the Apes", "genre": ["action/adventure/thriller", "drama", "sciencefiction/fantasy"], "description": "Two years have passed[9] since the human-hating bonobo Koba attacked the human survivors in San Francisco.  Since then, Caesar and his tribe of intelligent apes have been forced against a rogue U. S..."}, {"idx": 335, "id": "The Sitter", "genre": ["comedy"], "description": "The film opens with Noah Griffith (Jonah Hill) giving oral sex to his sex buddy Marisa (Ari Graynor).  Noah is a suspended college student who lives with his divorced mother and can't even keep a job. \r\nOne day when Noah is returning home from his girlfriend's house, his mother is about to leave to a party with a friend of hers..."}, {"idx": 1128, "id": "The Boy Next Door", "genre": ["action/adventure/thriller"], "description": "Claire Peterson (Jennifer Lopez) separates from her husband Garrett (John Corbett), after he was caught cheating with his secretary.  Her colleague and best friend Vicky Lansing (Kristin Chenoweth) urges Claire to divorce.  19-year-old Noah Sandborn (Ryan Guzman) moves in next door to help his wheelchair-bound uncle..."}, {"idx": 337, "id": "The Smurfs", "genre": ["action/adventure/thriller", "family"], "description": "As the Smurfs get ready for the Blue Moon Festival, Papa Smurf sees in his cauldron a vision of Clumsy Smurf reaching for a dragon wand and the Smurfs in cages while Gargamel laughs.  Not wanting this vision to come true, Papa Smurf disallows Clumsy to pick Smurf Roots.  Clumsy disobeys Papa and ends up unintentionally leading Gargamel and Azrael to the village..."}, {"idx": 890, "id": "The Smurfs 2", "genre": ["action/adventure/thriller", "family"], "description": "In preparation for her birthday celebration, the Smurfs read the story of Smurfette, how she was created by Gargamel to destroy them, only for Papa Smurf to rescue her and turn her fully into a Smurf.  Meanwhile, she is having nightmares about reverting to her original form and betraying her fellow Smurfs by turning them over to Gargamel.  The Smurfs are preparing a surprise party, but as Smurfette tries to find out what her fellow Smurfs are planning, none of them are saying a word..."}, {"idx": 1386, "id": "Smurfs: The Lost Village", "genre": ["comedy", "family", "sciencefiction/fantasy", "animation"], "description": "In Smurf Village, the Smurfs live peacefully among themselves and their leader is Papa Smurf.  Some of the Smurfs include Clumsy Smurf, Brainy Smurf, Hefty Smurf and Smurfette, who was created by Gargamel from a lump of clay, but redeemed by Papa Smurf and became part of the village.  Gargamel makes it his mission to capture the Smurfs, steal all of their essence, and become the most powerful wizard in the world..."}, {"idx": 348, "id": "Take Me Home Tonight", "genre": ["comedy"], "description": "The film is set in 1988 Los Angeles.  Matt Franklin is a recent MIT graduate who works at a Suncoast Video store while trying to figure out what he wants to do with his life, something that his police officer father has grown impatient with.  While working one day, Matt's high school crush, Tori Frederking walks into the store..."}, {"idx": 627, "id": "Goodbye Promise", "genre": ["drama"], "description": "When Matt moved to Hollywood he made a pact with himself that if he wasn't a working actor in exactly seven years he'd quit the business and move back to Washington, DC.  As the film opens Matt finds himself seven days shy of his self-prescribed deadline, and he's just as anonymous as the day he arrived into town.  After an afternoon of soul searching in the mountains he decides to honor his deadline, and plans to spend his final week in Hollywood visiting friends to tell them he's leaving for good and that he'll have a going away party to cap it all off..."}, {"idx": 352, "id": "Thor", "genre": ["action/adventure/thriller"], "description": "In 965 AD, Odin, king of Asgard, wages war against the Frost Giants of Jotunheim and their leader Laufey, to prevent them from conquering the nine realms, starting with Earth.  The Asgardian warriors defeat the Frost Giants and seize the source of their power, the Casket of Ancient Winters. \r\nIn the present,[N 2] Odin's son Thor prepares to ascend to the throne of Asgard, but is interrupted when Frost Giants attempt to retrieve the Casket..."}, {"idx": 911, "id": "Thor: The Dark World", "genre": ["action/adventure/thriller"], "description": "Eons ago, Bor, father of Odin, clashes with the Dark Elf Malekith, who seeks to unleash a weapon known as the Aether on the nine realms.  After conquering Malekith's forces, including enhanced warriors called the Kursed, on their home world of Svartalfheim, Bor safeguards the Aether within a stone column.  Unknown to Bor, Malekith, his lieutenant Algrim, and a handful of Dark Elves escape into suspended animation..."}, {"idx": 1506, "id": "Thor: Ragnarok", "genre": ["action/adventure/thriller", "comedy", "sciencefiction/fantasy"], "description": "Two years after the battle of Sokovia,[N 1] Thor has been unsuccessfully searching for the Infinity Stones, and is now imprisoned by the fire demon Surtur in Muspelheim.  Surtur reveals that Thor's father Odin is no longer on Asgard, and that the realm will soon be destroyed in the prophesied Ragnarök, once Surtur unites his crown with the Eternal Flame that burns in Odin's vault.  Thor defeats Surtur and claims his crown, believing he has prevented Ragnarök..."}, {"idx": 374, "id": "21 Jump Street", "genre": ["action/adventure/thriller", "comedy"], "description": "In 2005, scholarly student Morton Schmidt (Jonah Hill) and popular underachieving jock Greg Jenko (Channing Tatum) miss their school prom; Schmidt being rejected by the girl he asked to be his date and Jenko being barred from attending because of his grades.  Seven years later, the duo meets again at the Police Academy and become friends and partners on bicycle patrol.  They catch a break when they arrest Domingo (DeRay Davis), the leader of a one-percenter motorcycle gang, but are forced to release him after they failed to read him his Miranda rights..."}, {"idx": 1016, "id": "22 Jump Street", "genre": ["action/adventure/thriller", "comedy"], "description": "Two years following their success in the 21 Jump Street program, Schmidt (Jonah Hill) and Jenko (Channing Tatum) are back on the streets chasing narcotics.  However, after failing in the pursuit of a group of drug dealers led by Ghost (Peter Stormare), Deputy Chief Hardy (Nick Offerman) puts the duo back on the program to work for Captain Dickson (Ice Cube) – now located across the street at 22 Jump Street.  Their assignment is to go undercover as college students and locate the supplier of a drug known as \"WHY-PHY\" (Work Hard? Yes, Play Hard? Yes) that killed a student photographed buying it on campus from a dealer..."}, {"idx": 413, "id": "Beauty and the Beast 3D", "genre": ["family", "sciencefiction/fantasy", "animation"], "description": "One winter's night, an enchantress disguised as a beggar offers a cold-hearted prince a rose in exchange for shelter.  When he refuses, she transforms him into a beast and his servants into household objects.  She bestows the Beast with a magic mirror before hexing the rose and warning him that, unless he learns to love another and earns their love in return by the time the last petal falls, he and his servants will lose their humanity forever..."}, {"idx": 1373, "id": "Beauty and the Beast", "genre": ["action/adventure/thriller", "drama", "sciencefiction/fantasy", "romance", "musical"], "description": "A beautiful enchantress disguised as an old beggar woman arrives at a castle during a ball and offers the host, a cruel and selfish prince, a rose in return for shelter from a storm.  When he refuses, she reveals her identity.  To punish the prince for his selfishness, the enchantress transforms him into a beast and his servants into household objects, then erases the castle, the prince and his servants from the memories of their loved ones..."}, {"idx": 435, "id": "Campaign, The Campaign", "genre": ["comedy"], "description": "Democratic Congressman Cam Brady (Will Ferrell) of North Carolina's fictional 14th District is running for his fifth term unopposed.  His campaign is damaged by the revelation of his affair with one of his supporters, when Cam accidentally leaves a sexually explicit voice message on a local family's answering machine. \r\nThe corrupt businessman brothers Glenn and Wade Motch (Dan Aykroyd and John Lithgow) use this opportunity to convince Marty Huggins (Zach Galifianakis), tourism director for the town of Hammond and son of one of their associates, Raymond Huggins, to run against Cam on the Republican ticket, as part of a plan to profit from dealings with a Chinese company..."}, {"idx": 1168, "id": "Tracers", "genre": ["action/adventure/thriller"], "description": "Cam (Taylor Lautner) is a bike messenger in New York City struggling to make ends meet.  He rents from a woman, Angie, and her young son.  He is accosted by thugs who warn that he has missed two payments on a $15,000 loan..."}, {"idx": 444, "id": "Christmas with the Dead", "genre": ["horror/mystery"], "description": "Strange electrical currents hurtle towards Earth from outer space.  Calvin lives a typical life with his wife Ella and daughter Tina in the fictional East Texas town of Mud Creek It's during the holidays and one night Ella harasses him to put up Christmas decorations on their home.  Instead Calvin naps on the couch and then a freak lightning storm from the strange electrical currents causes everyone who sees it to drop dead..."}, {"idx": 583, "id": "Ruby Sparks", "genre": ["comedy", "romance"], "description": "Calvin Weir-Fields (Paul Dano) is a young novelist who is struggling to recreate the early success of his first novel and unable to commit to any of his ideas.  With his introverted personality and idealistic view of what it means to be in love, Calvin also struggles in finding relationships, feeling most women are only interested in an idolized and preconceived notion of who they believe him to be. \r\nHis therapist, Dr..."}, {"idx": 1307, "id": "Central Intelligence", "genre": ["action/adventure/thriller", "comedy"], "description": "In 1996, star athlete Calvin Joyner is being honored at his high school.  Halfway through Calvin's speech, Trevor Olson and a group of bullies throw a naked Robbie Weirdicht, who was showering, into the hall where the assembly is taking place, embarrassing him.  Only Calvin and his girlfriend, Maggie Johnson, are sympathetic towards Wierdicht..."}, {"idx": 1378, "id": "Life", "genre": ["sciencefiction/fantasy", "horror/mystery"], "description": "In the near future, the unmanned Pilgrim 7 space probe returns from Mars to Earth orbit with soil samples potentially containing evidence of extraterrestrial life.  The probe is captured and its samples retrieved by the International Space Station and its six-member crew.  Exobiologist Hugh Derry, who is paralyzed from the waist down, revives a dormant cell from the sample, which quickly grows into a multi-celled organism that American school children name \"Calvin\"..."}, {"idx": 489, "id": "Finding Nemo 3D", "genre": ["action/adventure/thriller", "animation"], "description": "Two clownfish, Marlin and Coral, admire their new home in the Great Barrier Reef, Australia, and their clutch of 400 eggs.  After a brief play fight, they spot a hungry barracuda staring at them.  Coral tries to save the eggs, and the barracuda attacks, knocking Marlin unconscious..."}, {"idx": 1306, "id": "Finding Dory", "genre": ["action/adventure/thriller", "animation"], "description": "Dory, a regal blue tang, gets separated from her parents as a child.  As she grows up, Dory attempts to search for them, but gradually forgets them due to her short-term memory loss.  In the flashback of the previous film, Finding Nemo, she joins Marlin – a clownfish looking for his missing son Nemo – after accidentally swimming into him..."}, {"idx": 496, "id": "For a Good Time, Call...", "genre": ["comedy"], "description": "After Lauren is dumped by her boyfriend, she is unable to afford a place of her own.  Her old friend Jesse informs her of a beautiful apartment right by Gramercy Park, but does not include the fact that his other friend Katie lives there.  During their freshman year of college, Lauren had to drive an inebriated Katie home from a frat party..."}, {"idx": 1008, "id": "Blended", "genre": ["comedy", "romance"], "description": "Divorcee Lauren Reynolds goes on a blind date with widower Jim Friedman at Hooters; it goes badly.  Lauren talks at work to her friend Jen about the experience.  Jim discusses his date with his co-worker..."}, {"idx": 521, "id": "The Hunger Games", "genre": ["action/adventure/thriller", "drama", "sciencefiction/fantasy"], "description": "As punishment for a past rebellion, the 12 districts of the nation of Panem are forced by the Capitol to select two tributes, one boy and one girl between 12 and 18, to fight to the death in the annual Hunger Games until there is only one survivor.  In District 12, after her younger sister Primrose is chosen, Katniss Everdeen volunteers to take her place.  She and fellow tribute Peeta Mellark are escorted to the Capitol by chaperone Effie Trinket and mentor Haymitch Abernathy, a past victor..."}, {"idx": 770, "id": "The Hunger Games: Catching Fire", "genre": ["action/adventure/thriller", "drama", "sciencefiction/fantasy"], "description": "After the 74th Hunger Games, Katniss Everdeen and Peeta Mellark return to District 12, where President Snow visits Katniss.  Snow explains that her actions in the Games have inspired uprisings.  He orders her to use the upcoming Victory Tour to convince people that her actions were out of love for Peeta and not defiance against the Capitol, or District 12 will be destroyed, \"just like District 13\"..."}, {"idx": 1104, "id": "The Hunger Games: Mockingjay – Part 1", "genre": ["action/adventure/thriller"], "description": "After being rescued from the destroyed arena in the 75th Hunger Games, Katniss Everdeen and fellow tributes Beetee and Finnick Odair are taken to District 13, now an underground district isolated from Panem that has been spearheading the rebellion.  There Katniss is reunited with her mother and sister Prim.  While recuperating, she is introduced to President Alma Coin, the rebel leader, and is told that immediately after the force field was destroyed by her arrow, riots erupted in over half the districts in Panem, which joined 13 in the rebel cause, though it also caused Snow to firebomb District 12 in retaliation..."}, {"idx": 551, "id": "Monsters, Inc. 3D", "genre": ["family", "animation"], "description": "The city of Monstropolis in the monster world is powered by energy from the screams of human children.  At the Monsters, Inc.  factory, skilled monsters employed as \"scarers\" venture into the human world to scare children and harvest their screams, through doors that activate portals to children's bedroom closets..."}, {"idx": 828, "id": "Monsters University", "genre": ["comedy", "family", "animation"], "description": "Michael \"Mike\" Wazowski aspires to become a scarer – a monster who enters the human world at night to scare children and harvest their screams for energy – after visiting Monsters Inc. , Monstropolis' most profitable scaring company, on a school field trip.  Eleven years later, Mike is a first-year scare major at Monsters University, where he meets James P..."}, {"idx": 560, "id": "ParaNorman", "genre": ["action/adventure/thriller", "comedy", "horror/mystery", "animation"], "description": "In the small town of Blithe Hollow, Massachusetts, Norman Babcock is an 11-year-old boy who speaks with the dead, including his late grandmother and various ghosts in town.  Almost no one believes him and he is isolated emotionally from his family while being ridiculed by his peers.  His best friend, Neil Downe, is an overweight boy who is bullied himself and finds in Norman a kindred spirit..."}, {"idx": 1089, "id": "Fury", "genre": ["action/adventure/thriller"], "description": "In April 1945, the Allies make their final push into Nazi Germany.  Don \"Wardaddy\" Collier, a battle-hardened U. S..."}, {"idx": 566, "id": "Pitch Perfect", "genre": ["comedy", "musical"], "description": "At the 2011 ICCA Finals, Barden University's all-female a cappella group, the Barden Bellas perform Ace of Base's \"The Sign\", which seems to be going well (other than the audience finding it rather boring), until Aubrey Posen (Anna Camp) suddenly projectile-vomits on the audience during her solo.  The Bellas are publicly humiliated, losing the competition.  Four months later, newly arrived Barden freshman Beca Mitchell (Anna Kendrick) has no desire to attend college, but she is forced to do so by her father (John Benjamin Hickey), a professor at the university, with whom Beca has a strained relationship..."}, {"idx": 1196, "id": "Pitch Perfect 2", "genre": ["comedy"], "description": "Three years after winning the previous competition, the Barden Bellas are now led by Beca Mitchell and three-time super senior Chloe Beale.  The Bellas have become ICCA champions each of these three years.  However, the group becomes involved in a national scandal, dubbed Muffgate, when a wardrobe malfunction causes Fat Amy's pants to rip in front of President Barack Obama, showing her genitals to the public since she did not wear underwear, leading to the Bellas' suspension from the ICCAs..."}, {"idx": 1533, "id": "Pitch Perfect 3", "genre": ["comedy", "musical"], "description": "Three years after the events of the second movie, the Bellas have graduated college, but have jobs which they all hate.  Desperate to see each other again to sing once more, Beca (Anna Kendrick), Fat Amy (Rebel Wilson), Chloe (Brittany Snow), Aubrey (Anna Camp), Lilly (Hana Mae Lee), Stacie (Alexis Knapp), Cynthia-Rose (Ester Dean), Florencia (Chrissie Fit), Jessica (Kelley Jakle), and Ashley (Shelley Regner) are all thrilled to learn that Emily (Hailee Steinfeld), now a senior at Barden and leader of the Barden Bellas, has seemingly asked for the Bellas to reunite at an event in New York Aquarium to sing with each other once more.  Upon arriving at the reunion they are told that the reunion was not for the Bellas to sing together, but to watch Emily sing with the new Bellas..."}, {"idx": 602, "id": "Taken 2", "genre": ["action/adventure/thriller"], "description": "At the funeral of his son Marko and associates in Tropojë, Albanian mafia head and low-lying freelance terrorist Murad Hoxha vows to seek vengeance on his son's killer.  Travelling to Paris with his men, he interrogates and tortures former intelligence agent Jean-Claude Pitrel, whose business card was found at the scene of Marko's death, but finds no information.  He then bribes a corrupt police official for Pitrel's files and deduces that Pitrel's old friend Bryan Mills was responsible and is in Istanbul..."}, {"idx": 1119, "id": "Taken 3", "genre": ["action/adventure/thriller"], "description": "Former covert operative Bryan Mills (Liam Neeson) visits his daughter, Kim (Maggie Grace), to deliver a birthday gift.  After an awkward visit, he invites his ex-wife, Lenore (Famke Janssen), to dinner.  Although she declines, she shows up at his apartment and tells him about her marital problems..."}, {"idx": 604, "id": "Ted", "genre": ["comedy"], "description": "In 1985, eight-year-old John Bennett is an only child living in Norwood, Massachusetts, a suburb of Boston, who wished for his new Christmas gift—a jumbo teddy bear named Ted—to come to life and become his friend.  The wish coincides with a shooting star and comes true; word spread and Ted was briefly a celebrity. \r\n27 years later, John (now 35) and Ted are still living in Boston, and are still staunch companions enjoying a hedonistic life..."}, {"idx": 1211, "id": "Ted 2", "genre": ["comedy"], "description": "John Bennett has been divorced from Lori Collins for six months.  Meanwhile, his best friend Ted, marries his girlfriend, Tami-Lynn.  One year later, following a heated argument, they decide to have a child..."}, {"idx": 609, "id": "A Thousand Words", "genre": ["comedy", "drama"], "description": "Jack McCall (Eddie Murphy) is a literary agent who uses his \"gift of gab\" to get various book deals, and he is not afraid to stretch the truth to get them.  While he is trying to get a book deal from a New Age self-help guru named Dr.  Sinja (Cliff Curtis), the guru sees through his deceit and agrees to the deal, only to later deliver a five-page book..."}, {"idx": 1223, "id": "Room (2015 film)", "genre": ["drama"], "description": "In Akron, Ohio, 24-year-old Joy Newsome and her 5-year-old son Jack live in a squalid shed they call Room.  They share a bed, toilet, bathtub, television, and rudimentary kitchen; the only window is a skylight.  They are captives of a man they call \"Old Nick\", Jack's biological father, who abducted Joy seven years prior and routinely rapes her while Jack sleeps in the closet..."}, {"idx": 614, "id": "Touchback", "genre": ["drama"], "description": "The setting begins with the introduction of Scott Murphy, former high school football hero.  An injury he received during the Ohio State High School Championship game terminated his scholarship to Ohio State University and his dreams of a professional career in football.  It's been twenty years since that game and Scott still resides with his family in the quiet town of Coldwater, Ohio..."}, {"idx": 934, "id": " Zero Charisma", "genre": ["comedy"], "description": "Scott Weidemeyer (Sam Eidson) is an overweight, overbearing table top role playing gamer.  He has a pathetic job, his at-home life is often unbearable as he still lives with his grandmother.  Worse yet, he's never had a girlfriend..."}, {"idx": 616, "id": "Underworld: Awakening", "genre": ["action/adventure/thriller", "horror/mystery"], "description": "A few years after the events of the second film, both the government and the general public have become aware of the existence of the Vampires and Lycans.  A program to study and potentially harness their powers soon escalates into an all-out genocide and shortly after the \"Purge\" begins, Selene and Michael are captured by humans.  Due to her enhanced vampiric traits, Selene is imprisoned in cryogenic suspension..."}, {"idx": 1333, "id": "Underworld: Blood Wars", "genre": ["action/adventure/thriller", "horror/mystery"], "description": "The remaining vampire covens are on the verge of being wiped out by the Lycans.  Both species are searching for Selene: the vampires seeking justice for the deaths of Viktor and Marcus, and the Lycans, led by Marius, intending to use her to locate Eve, whose blood holds the key to building an army of vampire-werewolf hybrids. \r\nSemira, a council member of the Eastern Coven, says she wants Selene to be granted clemency so that she can train the Eastern Coven's neophyte Death Dealers..."}, {"idx": 632, "id": "21 and Over", "genre": ["comedy"], "description": "Friends since high school, Casey and Miller are both over 21 and want to take their best friend Jeff Chang out for his 21st birthday while visiting him at college.  Jeff insists he can't, citing the important medical school interview he has to be ready for at 8am the next morning.  Miller threatens to make a lot of noise, keeping Jeff up all night, if he refuses to come out..."}, {"idx": 1475, "id": "Stronger", "genre": ["biography/documentary", "drama"], "description": "Jeff Bauman is a well-intentioned but underachieving Boston native who works at the deli counter of a Costco and lives in a small two-bedroom apartment with his alcoholic mother, Patty.  One day at the local bar, Jeff runs into his ex-girlfriend Erin, who is attracted to his kindness and charm but finds herself constantly frustrated by his lack of commitment.  After learning that Erin is running in the Boston Marathon to raise money for the hospital she works at, Jeff asks every patron in the bar to donate and then promises Erin he'll wait at the finish line for her with a big sign..."}, {"idx": 643, "id": "American Hustle", "genre": ["action/adventure/thriller"], "description": "In 1978, con artists Irving Rosenfeld and Sydney Prosser have started a relationship and are working together.  Sydney has improved Rosenfeld's scams, posing as English aristocrat \"Lady Edith Greensly. \" Irving loves Sydney but is hesitant to leave his unstable wife Rosalyn, fearing he will lose contact with his adoptive son Danny..."}, {"idx": 788, "id": "Jackass Presents: Bad Grandpa", "genre": ["comedy"], "description": "Billy is sitting in the waiting room of a lawyer's office.  His mother Kimmie comes out to grab him and tells him they're going to see his grandfather.  Irving Zisman is sitting in the waiting room of a hospital, checking out a magazine and looking at racy photos..."}, {"idx": 681, "id": "C.O.G.", "genre": ["drama"], "description": "David (Jonathan Groff) travels by bus, enduring days of discomfort and annoying people.  While reading On the Origin of Species, David is interrupted by a man who asks him if he has opened his heart to Jesus.  David replies that he does not believe in religion..."}, {"idx": 1136, "id": "Project Almanac", "genre": ["action/adventure/thriller"], "description": "In 2014, 17-year-old high school senior and aspiring inventor David Raskin (Jonny Weston) is admitted into MIT, but is unable to afford its tuition fees.  Upon learning his mother, Kathy Raskin (Amy Landecker), is planning to sell the house to help pay for his college, David enlists his sister Christina (Virginia Gardner) and his friends Adam Le (Allen Evangelista) and Quinn Goldberg (Sam Lerner) to sift through the belongings of his father Ben Raskin (Gary Weeks), an inventor who died in a car crash on David's seventh birthday, in the hope of finding something that David can use to get a scholarship instead.  David finds an old camera with a video recording of his seventh birthday party, in which he briefly spots his 17-year-old self in a reflection..."}, {"idx": 722, "id": "Evil Dead", "genre": ["horror/mystery"], "description": "In the woods, several men capture a frightened girl and tie her up in a cellar.  It is then revealed that she is possessed, and her father immolates her and shoots her in the head. \r\nSome time later, David and his girlfriend Natalie arrive at a cabin in the woods, where the pair meet up with his younger sister Mia and his friends Eric and Olivia..."}, {"idx": 1055, "id": "If I Stay", "genre": ["romance"], "description": "Mia Hall and her family are getting ready to go on with their normal day activities when it is announced on the radio that school has been canceled.  Mia's dad Denny is a teacher and as a result of the snow day does not have to go to work.  Mia's mom Kat, a travel agent, decides to call in sick and along with her family get on the road to visit Mia's grandparents who live on a farm..."}, {"idx": 1076, "id": "Annabelle", "genre": ["horror/mystery"], "description": "In 1967 in Santa Monica, John Form, a doctor, presents his expectant wife Mia with a rare vintage porcelain doll as a gift for their first child to be placed in a collection of dolls in their daughter's nursery. \r\nThat night, the couple is disturbed by the sounds of their next door neighbors, the Higgins, being murdered during a home invasion.  While Mia calls the police, she and John are attacked by the Higgins' killers..."}, {"idx": 723, "id": "The Face of Love", "genre": ["comedy", "romance"], "description": "Nikki (Bening) is a recent widow whose husband, Garret (Ed Harris), died in a drowning accident and who has not yet gotten over it.  Objects, people and situations that remind Nikki of the love of her life still haunt her.  Resigned to life alone, Nikki visits an art gallery she often frequented with Garret and sees a man (Harris in a dual role) whose resemblance to her husband stuns her..."}, {"idx": 883, "id": "Sexy Evil Genius", "genre": ["comedy"], "description": "Salesman Zach Newman sits alone in a bar when he meets Miranda Prague.  After talking to her for a few minutes, they realize that they are ex-lovers of the same woman, Nikki Franklyn.  They were both told to arrive at different times and wait for Nikki, who would be joining them later..."}, {"idx": 758, "id": "Haunted House, AA Haunted House", "genre": ["comedy", "horror/mystery"], "description": "In August 2012, a young couple, Malcolm and Kisha, move in together.  As Kisha arrives, she accidentally kills Shiloh, Malcolm's dog, by running him over with her car.  On the first night, Malcolm is constantly awoken with Kisha farting loudly that eventually drives him out of the room..."}, {"idx": 989, "id": "A Haunted House 2", "genre": ["comedy"], "description": "Malcolm Johnson and his cousin Ray-Ray are driving Malcolm's possessed girlfriend Kisha to the hospital after he beat her senseless for trying to attack him.  Kisha starts making a fuss and fights Malcolm, then breathes into Ray's face.  He passes out at the wheel and collides with a truck..."}, {"idx": 759, "id": "The Haunting in Connecticut 2: Ghosts of Georgia", "genre": ["horror/mystery"], "description": "The film is set in 1993.  Andy and Lisa Wyrick, along with their daughter Heidi, move into a rural home after receiving a deal from the bank.  They are told that no one had previously lived on the land, which is why they are getting such a great deal..."}, {"idx": 815, "id": "Lords of Salem, The Lords of Salem", "genre": ["horror/mystery"], "description": "In Salem, Massachusetts, Heidi (Sheri Moon Zombie), a recovering drug addict, works as a DJ at a hard rock station with her co-workers Whitey (Jeff Daniel Phillips) and Herman (Ken Foree).  She receives a strange wooden box containing an album by a band named The Lords.  At her home, a downtown apartment house, she and Whitey listen to the record, which is a series of string and woodwind instruments playing several notes, then repeating itself..."}, {"idx": 772, "id": "I Spit on Your Grave 2", "genre": ["horror/mystery"], "description": "Missouri-born Katie Carter (Dallender) is an aspiring young model living in New York City and working as a restaurant waitress and receptionist to make ends meet.  Desperate to update her modeling portfolio, she answers an advertisement offering a free photography session.  She then meets three Bulgarian brothers, photographer Ivan (Absolom) and his assistants Nikolai, known as \"Nicky\" (Aleksiev), and Georgy (Baharov), who becomes infatuated with Katie..."}, {"idx": 874, "id": "Safe Haven", "genre": ["action/adventure/thriller", "romance"], "description": "A terrified woman, Katie, flees her house in Boston, having been in the possession of a bloody knife.  After taking shelter with a neighbor, she is at the bus station trying to flee town.  She buys a bus ticket with her hair now cropped and bleached and stops in the small town of Southport, North Carolina..."}, {"idx": 1438, "id": "Inconceivable", "genre": ["action/adventure/thriller", "drama"], "description": "While holding a crying baby, a woman fights with and kills a man, presumably her husband.  Four years later, Angela (Gina Gershon) and Brian (Nicolas Cage) have a four-year-old daughter named Cora.  The three are a happy, close family..."}, {"idx": 820, "id": "LUV", "genre": ["drama"], "description": "The film begins with Woody Watson (Michael Rainey Jr. ) having a dream about him and his mother in the woods, but he then wakes up.  Woody lives with his grandmother (Lonette McKee) in the inner city of Baltimore and longs to be reunited with his mother who is in rehab in North Carolina..."}, {"idx": 833, "id": "Nebraska", "genre": ["drama"], "description": "In Billings, Montana, a police officer arrives and discovers Woody Grant walking around in the traffic.  Woody is picked up by his son David, who learns that Woody wants to go to Lincoln, Nebraska, to collect a million dollar sweepstakes prize he believes he has won.  When David sees the sweepstakes letter, he knows immediately that it is a mail scam designed to get gullible people to purchase magazine subscriptions..."}, {"idx": 835, "id": "Now You See Me", "genre": ["action/adventure/thriller"], "description": "Four stage magicians, J.  Daniel \"Danny\" Atlas (Jesse Eisenberg), Merritt McKinney (Woody Harrelson), Henley Reeves (Isla Fisher), and Jack Wilder (Dave Franco), are each given a tarot card that leads them to the same empty New York City apartment where they find information from an unknown benefactor. \r\nA year later, the four have their first major performance as the Four Horsemen in an elaborate Las Vegas show funded by insurance magnate Arthur Tressler (Michael Caine)..."}, {"idx": 1305, "id": "Now You See Me 2", "genre": ["action/adventure/thriller"], "description": "Eighteen months after outwitting the FBI, the remaining members of the Four Horsemen—J.  Daniel Atlas (Jesse Eisenberg), Merritt McKinney (Woody Harrelson) and Jack Wilder (Dave Franco)—are in hiding in New York City, awaiting further instructions from The Eye, the secret society of magicians they've been recruited into.  Atlas, having grown tired of waiting for a mission, seeks out The Eye himself..."}, {"idx": 839, "id": "Olympus Has Fallen", "genre": ["action/adventure/thriller"], "description": "Former Army Ranger Mike Banning (Gerard Butler) is the lead U. S.  Secret Service agent assigned to head the U..."}, {"idx": 1261, "id": "London Has Fallen", "genre": ["action/adventure/thriller"], "description": "Western intelligence services of the G8 track down Pakistani arms dealer Aamir Barkawi (Alon Moni Aboutboul) as the mastermind behind several terrorist attacks, and authorize an American drone strike on Barkawi's compound, apparently killing Barkawi and his family. \r\nTwo years later, UK Prime Minister James Wilson suddenly dies, and arrangements are made for the Western world leaders to attend his funeral in London.  Secret Service Director Lynne Jacobs (Angela Bassett) assigns agent Mike Banning (Gerard Butler), a close friend of U..."}, {"idx": 856, "id": "Planes", "genre": ["comedy", "family", "animation"], "description": "Dusty Crophopper is a crop duster plane who works at a cornfield and practices aerobatic maneuvers in his spare time, dreaming of becoming a racer.  His dreams are scorned by his boss, Leadbottom, and his forklift/mechanic friend, Dottie.  However, he is supported by his fuel truck friend, Chug..."}, {"idx": 1035, "id": "Planes: Fire & Rescue", "genre": ["action/adventure/thriller"], "description": "Since winning the Wings Around the Globe race in the first film, Dusty Crophopper has a successful career as a racer.  Unfortunately, his engine's gearbox becomes damaged because Dusty routinely operates the engine beyond its design limits.  With that particular model of gearbox now out of production and none available anywhere, Dusty's mechanic Dottie fits a warning light to his control panel to ensure he doesn't damage his gearbox any further..."}, {"idx": 860, "id": "The Pretty One", "genre": ["drama"], "description": "Laurel and Audrey (Zoe Kazan) are identical twins.  Although they look the same on the outside, their personalities are very different, with Audrey being popular, sophisticated and successful while Laurel is shy, childlike, awkward and still living at home with their widowed father (John Carroll Lynch) and his new fiancée, and helping him with his work of reproducing famous paintings.  At their birthday party, Audrey decides to take Laurel to live with her, and in preparation to the move, Laurel gets a new haircut that makes her look like her sister..."}, {"idx": 957, "id": "The Pretty One", "genre": ["comedy"], "description": "Laurel and Audrey (Zoe Kazan) are identical twins.  Although they look the same on the outside, their personalities are very different, with Audrey being popular, sophisticated and successful while Laurel is shy, childlike, awkward and still living at home with their widowed father (John Carroll Lynch) and his new fiancée, and helping him with his work of reproducing famous paintings.  At their birthday party, Audrey decides to take Laurel to live with her, and in preparation to the move, Laurel gets a new haircut that makes her look like her sister..."}, {"idx": 891, "id": "The Smurfs: The Legend of Smurfy Hollow", "genre": ["family", "animation"], "description": "As the story begins, Hefty, Clumsy, and Panicky are out in the forest at night with a cart full of smurfberries that has a broken wheel.  Unable to fix the wheel, the three of them sit together around a campfire roasting smurfberries when Clumsy has the idea of telling a ghost story to pass the time.  Narrator then joins the three Smurfs to tell his own kind of ghost story..."}, {"idx": 898, "id": "Stand Up Guys", "genre": ["action/adventure/thriller", "comedy"], "description": "Released from prison after serving 28 years, Val reunites with his old friend and partner Doc.  Doc has been ordered by mob boss Claphands to kill Val as soon as he gets out.  One of the first things Val wants is to visit a local brothel, which is run by Wendy..."}, {"idx": 1109, "id": "Inherent Vice", "genre": ["comedy", "drama"], "description": "In 1970, Shasta Fay Hepworth visits the beach house of her ex-boyfriend, Larry \"Doc\" Sportello, a private investigator and hippie in Gordita Beach, Los Angeles County.  Shasta tells him about her new lover, Michael Z.  \"Mickey\" Wolfmann, a wealthy real estate developer..."}, {"idx": 939, "id": "The Legend of Hercules", "genre": ["sciencefiction/fantasy"], "description": "In 1200 BC ancient Greece, King Amphitryon of Tiryns invades Argos.  Amphitryon eventually fights rival King Galenus in personal combat, killing Galenus and seizing his kingdom.  Queen Alcmene is disgusted by her husband's thirst for power and warmongering..."}, {"idx": 1040, "id": "Hercules", "genre": ["action/adventure/thriller"], "description": "Hercules is the leader of a band of mercenaries composed of the spear-wielding prophet Amphiaraus of Argos, the knife-throwing thief Autolycus of Sparta, the feral warrior Tydeus of Thebes, the Amazon archer Atalanta of Scythia and his nephew storyteller Iolaus of Athens.  Hercules is said to be the demigod son of Zeus, who completed the legendary Twelve Labors, only to be betrayed by Hera who drove him insane and caused him to murder his wife Megara and their children during a visit to King Eurystheus.  Throughout the film, it is not clearly established that Hercules is truly the son of Zeus, and many are skeptical of the claim as well as of the stories of Hercules' famous Twelve Labors..."}, {"idx": 943, "id": "The Nut Job", "genre": ["comedy"], "description": "In the fictional town of Oakton City,[2] a purple squirrel named Surly (Will Arnett) and his mute rat partner Buddy reside in Liberty Park where their thieving reputation has made them outcasts.  A group of urban animals led by Raccoon (Liam Neeson) and his cardinal assistant are running low on food for winter.  Red squirrel Andie (Katherine Heigl) and glory hogging gray squirrel Grayson (Brendan Fraser) compete with Surly and Buddy to scavenge from a peanut cart manned by Lucky (Scott Yaphe) and Fingers (James Rankin) who are casing a bank..."}, {"idx": 1457, "id": "The Nut Job 2: Nutty by Nature", "genre": ["comedy", "animation"], "description": "Surly Squirrel is now loved by Liberty Park's Urban wildlife community, and currently overseeing an all-you-can-eat buffet at Maury's Nut Shop.  This worries Andie, as she prefers a more hard-working outlook on life.  Despite Surly's reassurances all is well, Maury's Nut Shop is accidentally blown up by Mole after he forgets to cut down pressure from the boiler..."}, {"idx": 944, "id": "Ride Along", "genre": ["comedy"], "description": "James Payton is a detective, on an undercover operation where fake passports are being smuggled into Atlanta by a man named \"Omar\".  After a shootout with the smugglers, and a car chase that leaves one injured, the lieutenant leading the case ask James to drop the case on \"Omar\", something James doesn't do. \r\nBen Barber, a fast-talking, jumpy high school security guard who plays video games on his spare time, applies for the Atlanta City Police Academy..."}, {"idx": 1238, "id": "Ride Along 2", "genre": ["action/adventure/thriller", "comedy"], "description": "The film starts in Miami on the boat of crime lord Antonio Pope.  His hacker A. J..."}, {"idx": 966, "id": "Barefoot", "genre": ["comedy", "romance"], "description": "Jay Wheeler, the \"black sheep\" son of a rich family starts working as a janitor at a psychiatric hospital as part of his parole.  While walking through the hospital one night he overhears another janitor, Frakel, telling a patient that he's a doctor and needs to give her physical examination, in order to rape her.  After hearing this, Jay knocks out Frakel and tells the patient, Daisy Kensington, to go back to bed..."}, {"idx": 1162, "id": "It Follows", "genre": ["horror/mystery"], "description": "A young girl named Annie Marshall is stalked throughout her suburban neighborhood by an unseen entity.  She flees to a beach and calls her parents to say goodbye.  That night, she is killed and her horribly mutilated body is left on the shore..."}, {"idx": 977, "id": "Divergent", "genre": ["sciencefiction/fantasy"], "description": "In a futuristic dystopian Chicago, society is divided into five factions: Abnegation (the selfless), Amity (the peaceful), Candor (the honest), Dauntless (the brave) and Erudite (the intelligent).  The remaining population are the Factionless.  At the age of 16, they undergo a Human serum albumin-induced psychological aptitude test which indicates their best-suited faction, though they are allowed to choose any faction as their permanent group at the subsequent Choosing Ceremony..."}, {"idx": 1166, "id": "The Divergent Series: Insurgent", "genre": ["action/adventure/thriller"], "description": "Five days after the assault on the Abnegation faction by Erudite leader Jeanine (Kate Winslet) and her mind-controlled Dauntless soldiers, Jeanine has declared martial law and that the Divergents and those allied with them are the enemy.  Among the Abnegation wreckage, Dauntless leader Eric (Jai Courtney) recovers a five-sided box: each side has a faction symbol.  Jeanine presumes it contains data from the city's founders and the means to end the Divergence problem..."}, {"idx": 1208, "id": "Dope", "genre": ["action/adventure/thriller", "comedy", "drama"], "description": "Malcolm Adekanbi and his best friends, Jib and Diggy, are high school \"geeks\" living in \"The Bottoms\" a crime-frequent neighborhood in Inglewood, California.  Malcolm is confident he will be admitted to his dream school, Harvard University, on his academic ability, but his school counselor berates him since their school is in a run-down suburb in Los Angeles.  He suggests Malcolm take college application process more seriously, starting with an upcoming interview with businessman and Harvard alumnus, Austin Jacoby..."}, {"idx": 992, "id": "13 Sins", "genre": ["horror/mystery"], "description": "Elliot Brindle, a meek salesman, loses his job despite his debt and the people who depend on him: Michael, his mentally handicapped brother; Shelby, his pregnant fiancee; and an unnamed, abusive father.  Elliot receives a mysterious phone call that offers him $1,000 to assertively kill a fly that has been harassing him.  After Elliot checks his bank account online and sees that he has been credited, he accepts the next challenge: to eat the dead fly..."}, {"idx": 1134, "id": "Black or White", "genre": ["drama"], "description": "Elliot Anderson (Kevin Costner) is widowed after a car crash leads to the death of his wife.  Elliot raises his granddaughter Eloise as he struggles with his grief by binge-drinking.  Elliot's world is turned upside-down when the child's black grandmother, Rowena (Octavia Spencer), demands that Eloise be brought under the care of her father, Rowena's son, Reggie (Andre Holland), a drug addict whom Elliot blames for the negligence that led to the death of his own daughter..."}, {"idx": 1335, "id": "The Bye Bye Man", "genre": ["horror/mystery"], "description": "In 1969, a mass murder occurs in which a man kills people on his block.  As he shoots the neighbors, he continuously asks if anyone spoke about \"the name\" which cannot be said.  He also repeats the same thing over and over: \"Don't say it, don't think it; don't think it, don't say it..."}, {"idx": 1003, "id": "Neighbors", "genre": ["comedy"], "description": "Mac (Seth Rogen) and Kelly Radner (Rose Byrne) are a young couple with an infant daughter, Stella.  The restrictions of parenthood make it difficult for them to maintain their old lifestyle, which alienates them from their friends Jimmy Blevins (Ike Barinholtz) and his ex-wife, Paula (Carla Gallo).  One day, the couple finds out that Delta Psi Beta, a fraternity known for their outrageous parties, has moved into an adjacent house..."}, {"idx": 1296, "id": "Neighbors 2: Sorority Rising", "genre": ["comedy"], "description": "Two years after the events of the first film, Mac (Seth Rogen) and Kelly (Rose Byrne) are trying to sell their home with the arrival of another baby.  A couple, Eric (Sam Richardson) and Jessica Baiers (Abbi Jacobson) are looking to buy; the realtor (Liz Cackowski) tells Mac and Kelly that their house is in escrow for 30 days, so the buyers will check in every now and then to make sure everything is okay.  Meanwhile, Mac's friend, Jimmy (Ike Barinholtz), and his once-again wife Paula (Carla Gallo) are also expecting a baby..."}, {"idx": 1043, "id": "Guardians of the Galaxy", "genre": ["action/adventure/thriller"], "description": "In 1988, following his mother's death, a young Peter Quill is abducted from Earth by the Ravagers, a group of space pirates led by Yondu Udonta.  Twenty-six years later on the planet Morag, Quill steals an orb but is attacked by Korath, a subordinate to the fanatical Kree, Ronan.  Although Quill escapes with the orb, Yondu discovers his theft and issues a bounty for his capture, while Ronan sends the assassin Gamora after the orb..."}, {"idx": 1402, "id": "Guardians of the Galaxy Vol. 2", "genre": ["action/adventure/thriller", "comedy", "sciencefiction/fantasy"], "description": "In 2014, Peter Quill, Gamora, Drax, Rocket, and Baby Groot are renowned as the Guardians of the Galaxy.  Ayesha, leader of the Sovereign race, has the Guardians protect valuable batteries from an inter-dimensional monster in exchange for Gamora's estranged sister Nebula, who was caught attempting to steal the batteries.  After Rocket steals some for himself, the Sovereign attacks the Guardians' ship with a fleet of drones..."}, {"idx": 1049, "id": "Teenage Mutant Nina Turtles", "genre": ["sciencefiction/fantasy"], "description": "April O'Neil, a local reporter for Channel 6 Eyewitness News in New York City, investigates a crime wave by a group of criminals called the Foot Clan.  At a dock at night, she sees the Foot raiding cargo containers.  After an unseen vigilante attacks the thieves, April notices a symbol left behind..."}, {"idx": 1300, "id": "TMNT 2: Out of the Shadows", "genre": ["action/adventure/thriller", "comedy", "sciencefiction/fantasy"], "description": "Two years after their battle with Shredder and Eric Sacks, the Teenage Mutant Ninja Turtles, Leonardo, Donatello, Raphael, and Michelangelo, still live beneath the sewers of New York City, having allowed Vern Fenwick to take the credit for Shredder's defeat.  At Grand Central Station, April O'Neil discovers and informs the turtles that scientist Baxter Stockman is working for Shredder and plans to bust him out of prison.  As Shredder is transferred between prisons alongside criminals Bebop and Rocksteady by corrections officer Casey Jones, the Foot Clan attack the convoy transporting them..."}, {"idx": 1144, "id": "Fifty Shades of Grey", "genre": ["action/adventure/thriller", "romance"], "description": "Twenty-one-year-old Anastasia \"Ana\" Steele is an English literature major at Washington State University's (\"WSU\") satellite campus near Vancouver, Washington.  When her roommate, Kate Kavanagh, becomes ill and is unable to interview Christian Grey, a 27-year-old billionaire entrepreneur, for the college newspaper, Ana agrees to go in her place.  At Christian's Seattle headquarters called Grey House, Ana stumbles her way through the meeting..."}, {"idx": 1352, "id": "Fifty Shades Darker", "genre": ["drama", "romance"], "description": "After Anastasia Steele leaves Christian Grey, he has nightmares about his abusive childhood.  Meanwhile, Ana begins a new job as an assistant to Jack Hyde, an editor at Seattle Independent Publishing (SIP) whose previous three assistants all quit within the last 18 months.  Ana unexpectedly runs into Christian at the opening of her friend Jose Rodriguez's photography exhibit..."}, {"idx": 1145, "id": "Kingsman: The Secret Service", "genre": ["action/adventure/thriller"], "description": "During a mission in the Middle East in 1997, probationary secret agent Lee Unwin sacrifices himself to protect his superior Harry Hart.  Hart, blaming himself, returns to London to give Lee's widow Michelle and her young son Gary \"Eggsy\" a medal engraved with an emergency assistance number. \r\nSeventeen years later, Eggsy, having dropped out of training for the Royal Marines despite his intelligence and capability, has become a stereotypical chav..."}, {"idx": 1473, "id": "Kingsman: The Golden Circle", "genre": ["action/adventure/thriller", "comedy"], "description": "A year after the events of the previous film, Eggsy Unwin has officially joined Kingsman, taken his late mentor Harry Hart's title of Galahad and begun a relationship with Tilde, Crown Princess of Sweden.  On his way home from the tailor shop, he is ambushed by Charlie Hesketh, a former Kingsman trainee who lost his arm and vocal cords during the Valentine incident, replacing them with cybernetics.  Eggsy evades Charlie and his henchmen in a car chase across London, but Charlie's severed cybernetic arm hacks into the Kingsman servers through the computer system of Eggsy's car..."}, {"idx": 1269, "id": "The Divergent Series: Allegiant", "genre": ["action/adventure/thriller", "sciencefiction/fantasy"], "description": "After Evelyn forbids anyone from leaving Chicago, she announces that all Erudite members involved in the previous coup attempt are to be put on trial and executed if found guilty.  Tris and Four rescue Caleb from execution and try to escape over the wall, along with Tori, Peter and Christina.  The group is ambushed by Edgar, who kills Tori, but the group escapes, and pass the wall and are intercepted by soldiers with advanced weaponry who take the group to the Bureau of Genetic Welfare, a city of advanced technology hidden behind a cloaking shield..."}, {"idx": 1230, "id": "Daddy's Home", "genre": ["comedy"], "description": "Mild-mannered radio executive Brad Whitaker struggles to be a good stepfather to his wife Sara's two children, Megan and Dylan, and is seemingly sterile after an accident to his testicles some years ago.  The children begin to grow closer to Brad, with Dylan confiding in him that he is being picked on at school and Megan asking him to take her to a father/daughter dance at her school.  One night, the kids' biological father, Sara's former husband Dusty Mayron, calls and discovers Sara's marriage with Brad..."}, {"idx": 1511, "id": "Daddy's Home 2", "genre": ["comedy"], "description": "After finally becoming friends at the end of the first film, Brad Whittaker and Dusty Mayron have a co-dad system where their two children, Megan and Dylan, take turns at each father's house.  Dusty has also remarried, this time to Karen, a writer, and is stepdad to Adrianna, Karen's daughter. \r\nBrad and his wife, Sara, along with Dusty and Karen, attend a school play for Megan, where she announces to the whole audience that she doesn't like the fact that she has to go back and forth to different houses all the time..."}, {"idx": 1401, "id": "Sleight", "genre": ["drama", "sciencefiction/fantasy"], "description": "A young street magician named Bo (Jacob Latimore) is left to care for his little sister after their parents' death and turns to illegal activities to keep a roof over their heads. \r\nBy day Bo performs magic tricks all over Los Angeles, with his specialty as being able to control anything metal, even float it in the air.  He does this by building an electromagnet into his arm, with the negative electrode of the battery running to his thumb and the positive electrode running to his fingers..."}, {"idx": 1516, "id": "The Star", "genre": ["action/adventure/thriller", "comedy", "animation"], "description": "In \"9 months B. C. \", Mary is visited by an angel telling her she will bear the Messiah..."}], "links": [{"source_idx": 4, "target_idx": 1299, "source": "Alice in Wonderland", "target": "Alice Through the Looking Glass", "value": 0.6094163238244873}, {"source_idx": 12, "target_idx": 557, "source": "Black Swan", "target": "The Oranges", "value": 0.5038876594003834}, {"source_idx": 15, "target_idx": 1070, "source": "The Bounty Hunter", "target": "The Skeleton Twins", "value": 0.5509338085280162}, {"source_idx": 22, "target_idx": 564, "source": "Charlie St. Cloud", "target": "The Perks of Being a Wallflower", "value": 0.6324665050399623}, {"source_idx": 25, "target_idx": 625, "source": "Clash of the Titans", "target": "Wrath of the Titans", "value": 0.6475755031676635}, {"source_idx": 34, "target_idx": 253, "source": "Darkening Sky", "target": "A Good Old Fashioned Orgy", "value": 0.5301489037338581}, {"source_idx": 39, "target_idx": 707, "source": "Despicable Me", "target": "Despicable Me 2", "value": 0.6042165350480603}, {"source_idx": 39, "target_idx": 1435, "source": "Despicable Me", "target": "Despicable Me 3", "value": 0.5704999663070663}, {"source_idx": 41, "target_idx": 106, "source": "Diary of a Wimpy Kid", "target": "Little Fockers", "value": 0.5211344268952411}, {"source_idx": 41, "target_idx": 231, "source": "Diary of a Wimpy Kid", "target": "Diary of a Wimpy Kid: Rodrick Rules", "value": 0.721100133878576}, {"source_idx": 41, "target_idx": 472, "source": "Diary of a Wimpy Kid", "target": "Diary of a Wimpy Kid: Dog Days", "value": 0.6833548045377011}, {"source_idx": 41, "target_idx": 1411, "source": "Diary of a Wimpy Kid", "target": "Diary of a Wimpy Kid: The Long Haul", "value": 0.5584826572382343}, {"source_idx": 44, "target_idx": 1054, "source": "Due Date", "target": "The One I Love", "value": 0.559473007756607}, {"source_idx": 44, "target_idx": 1344, "source": "Due Date", "target": "A Dog's Purpose", "value": 0.578039047908335}, {"source_idx": 45, "target_idx": 1491, "source": "Easy A", "target": "Professor Marston and the Wonder Women", "value": 0.5143957031182114}, {"source_idx": 47, "target_idx": 211, "source": "The Twilight Saga: Eclipse", "target": "The Twilight Saga: Breaking Dawn - Part 1", "value": 0.7631585770095276}, {"source_idx": 47, "target_idx": 430, "source": "The Twilight Saga: Eclipse", "target": "Breaking Wind", "value": 0.6370800829321999}, {"source_idx": 67, "target_idx": 751, "source": "Grown Ups", "target": "Grown Ups 2", "value": 0.5962890322078686}, {"source_idx": 69, "target_idx": 262, "source": "Harry Potter and the Deathly Hallows: Part 1", "target": "Harry Potter and the Deathly Hallows: Part 2", "value": 0.6710151033802496}, {"source_idx": 72, "target_idx": 1148, "source": "Hot Tub Time Machine", "target": "Hot Tub Time Machine 2", "value": 0.7117100837874025}, {"source_idx": 74, "target_idx": 1018, "source": "How to Train Your Dragon", "target": "How to Train Your Dragon 2", "value": 0.6643610442798356}, {"source_idx": 79, "target_idx": 784, "source": "Iron Man 2", "target": "Iron Man 3", "value": 0.5046588857795312}, {"source_idx": 80, "target_idx": 976, "source": "It's Kind of a Funny Story", "target": "Cheap Thrills (film)", "value": 0.5490199579240707}, {"source_idx": 88, "target_idx": 799, "source": "Kick-Ass", "target": "Kick-Ass 2", "value": 0.5918446292234657}, {"source_idx": 90, "target_idx": 1091, "source": "The Killer Inside Me", "target": "Nightcrawler", "value": 0.6799250058985564}, {"source_idx": 90, "target_idx": 1148, "source": "The Killer Inside Me", "target": "Hot Tub Time Machine 2", "value": 0.6132263541078675}, {"source_idx": 95, "target_idx": 807, "source": "The Last Exorcism", "target": "The Last Exorcism Part II", "value": 0.5888463998800924}, {"source_idx": 102, "target_idx": 141, "source": "Letters to God", "target": "Remember Me", "value": 0.5059844517393662}, {"source_idx": 106, "target_idx": 231, "source": "Little Fockers", "target": "Diary of a Wimpy Kid: Rodrick Rules", "value": 0.5083757813000893}, {"source_idx": 106, "target_idx": 472, "source": "Little Fockers", "target": "Diary of a Wimpy Kid: Dog Days", "value": 0.5832873871095723}, {"source_idx": 106, "target_idx": 1207, "source": "Little Fockers", "target": "Me and Earl and the Dying Girl", "value": 0.5280532762587831}, {"source_idx": 106, "target_idx": 1411, "source": "Little Fockers", "target": "Diary of a Wimpy Kid: The Long Haul", "value": 0.5409615518796878}, {"source_idx": 109, "target_idx": 247, "source": "Love & Other Drugs", "target": "Friends with Benefits", "value": 0.5523815490781119}, {"source_idx": 111, "target_idx": 821, "source": "Machete", "target": "Machete Kills", "value": 0.5370954440701244}, {"source_idx": 122, "target_idx": 646, "source": "The Next Three Days", "target": "Apartment 1303 3D", "value": 0.5037494408764398}, {"source_idx": 128, "target_idx": 310, "source": "Paranormal Activity 2", "target": "Paranormal Activity 3", "value": 0.519577285421407}, {"source_idx": 129, "target_idx": 990, "source": "Passion Play", "target": "Kid Cannabis", "value": 0.5892060763883455}, {"source_idx": 130, "target_idx": 852, "source": "Percy Jackson & the Olympians: The Lightning Thief", "target": "Percy Jackson: Sea of Monsters", "value": 0.6796913485558562}, {"source_idx": 137, "target_idx": 176, "source": " Rabbit Hole", "target": "Vampires Suck", "value": 0.572496332653844}, {"source_idx": 138, "target_idx": 150, "source": "Ramona and Beezus", "target": "Scott Pilgrim vs. the World", "value": 0.5354163289850022}, {"source_idx": 140, "target_idx": 867, "source": "Red", "target": "RED 2", "value": 0.5314897917205081}, {"source_idx": 143, "target_idx": 579, "source": "Resident Evil: Afterlife", "target": "Resident Evil: Retribution", "value": 0.5734417070056077}, {"source_idx": 143, "target_idx": 1345, "source": "Resident Evil: Afterlife", "target": "Resident Evil: The Final Chapter", "value": 0.5555585792699022}, {"source_idx": 152, "target_idx": 686, "source": "Sex and the City 2", "target": "Carrie", "value": 0.5754033505445432}, {"source_idx": 180, "target_idx": 619, "source": "What's Wrong with Virginia", "target": "Virginia", "value": 1.0000000000000002}, {"source_idx": 192, "target_idx": 307, "source": "50/50", "target": "No Strings Attached", "value": 0.5140750713362824}, {"source_idx": 203, "target_idx": 398, "source": "Atlas Shrugged: Part I", "target": "Atlas Shrugged: Part II", "value": 0.7343684923349388}, {"source_idx": 211, "target_idx": 430, "source": "The Twilight Saga: Breaking Dawn - Part 1", "target": "Breaking Wind", "value": 0.6118589432434178}, {"source_idx": 214, "target_idx": 982, "source": "Captain America: The First Avenger", "target": "Captain America: The Winter Soldier", "value": 0.5403123072049255}, {"source_idx": 231, "target_idx": 472, "source": "Diary of a Wimpy Kid: Rodrick Rules", "target": "Diary of a Wimpy Kid: Dog Days", "value": 0.673851428883637}, {"source_idx": 231, "target_idx": 1411, "source": "Diary of a Wimpy Kid: Rodrick Rules", "target": "Diary of a Wimpy Kid: The Long Haul", "value": 0.6796496609822495}, {"source_idx": 234, "target_idx": 1063, "source": "Dolphin Tale", "target": "Dolphin Tale 2", "value": 0.6776121614807613}, {"source_idx": 240, "target_idx": 1439, "source": "Dylan Dog: Dead of Night", "target": "2:22", "value": 0.5100301992866891}, {"source_idx": 242, "target_idx": 630, "source": "Everything Must Go", "target": "12 Rounds 2: Reloaded", "value": 0.5198999566997564}, {"source_idx": 244, "target_idx": 726, "source": "Fast Five", "target": "Fast & Furious 6", "value": 0.5709067847330243}, {"source_idx": 244, "target_idx": 1174, "source": "Fast Five", "target": "Furious 7", "value": 0.6049619586798869}, {"source_idx": 244, "target_idx": 1391, "source": "Fast Five", "target": "The Fate of the Furious", "value": 0.5445055121941191}, {"source_idx": 248, "target_idx": 732, "source": "Fright Night", "target": "Fright Night 2: New Blood", "value": 0.6019852610994072}, {"source_idx": 258, "target_idx": 753, "source": "The Hangover: Part II", "target": "The Hangover Part III", "value": 0.5909247956217459}, {"source_idx": 277, "target_idx": 782, "source": "Insidious", "target": "Insidious: Chapter 2", "value": 0.698261373258988}, {"source_idx": 279, "target_idx": 509, "source": "Jack and Jill", "target": "Gone", "value": 0.5216232725575941}, {"source_idx": 286, "target_idx": 1246, "source": "Kung Fu Panda 2", "target": "Kung Fu Panda 3", "value": 0.528902000088838}, {"source_idx": 296, "target_idx": 1070, "source": "Mars Needs Moms", "target": "The Skeleton Twins", "value": 0.5512410488005809}, {"source_idx": 304, "target_idx": 978, "source": "The Muppets", "target": "Muppets Most Wanted", "value": 0.5044559602138213}, {"source_idx": 325, "target_idx": 987, "source": "Rio", "target": "Rio 2", "value": 0.6853017297311988}, {"source_idx": 326, "target_idx": 1030, "source": "Rise of the Planet of the Apes", "target": "Dawn of the Planet of the Apes", "value": 0.5479990689886667}, {"source_idx": 326, "target_idx": 1442, "source": "Rise of the Planet of the Apes", "target": "War for the Planet of the Apes", "value": 0.5659565541446061}, {"source_idx": 335, "target_idx": 1128, "source": "The Sitter", "target": "The Boy Next Door", "value": 0.612078703944653}, {"source_idx": 337, "target_idx": 890, "source": "The Smurfs", "target": "The Smurfs 2", "value": 0.7302690276184814}, {"source_idx": 337, "target_idx": 1386, "source": "The Smurfs", "target": "Smurfs: The Lost Village", "value": 0.7226348162491253}, {"source_idx": 348, "target_idx": 627, "source": "Take Me Home Tonight", "target": "Goodbye Promise", "value": 0.5041611578928731}, {"source_idx": 352, "target_idx": 911, "source": "Thor", "target": "Thor: The Dark World", "value": 0.5670317012144217}, {"source_idx": 352, "target_idx": 1506, "source": "Thor", "target": "Thor: Ragnarok", "value": 0.5928727987303007}, {"source_idx": 374, "target_idx": 1016, "source": "21 Jump Street", "target": "22 Jump Street", "value": 0.7315149976020224}, {"source_idx": 413, "target_idx": 1373, "source": "Beauty and the Beast 3D", "target": "Beauty and the Beast", "value": 0.9300923567555823}, {"source_idx": 435, "target_idx": 1168, "source": "Campaign, The Campaign", "target": "Tracers", "value": 0.50792765771922}, {"source_idx": 444, "target_idx": 583, "source": "Christmas with the Dead", "target": "Ruby Sparks", "value": 0.5147556454458443}, {"source_idx": 444, "target_idx": 1307, "source": "Christmas with the Dead", "target": "Central Intelligence", "value": 0.5496926062991411}, {"source_idx": 444, "target_idx": 1378, "source": "Christmas with the Dead", "target": "Life", "value": 0.5440446392343596}, {"source_idx": 472, "target_idx": 1207, "source": "Diary of a Wimpy Kid: Dog Days", "target": "Me and Earl and the Dying Girl", "value": 0.5227709264553531}, {"source_idx": 472, "target_idx": 1411, "source": "Diary of a Wimpy Kid: Dog Days", "target": "Diary of a Wimpy Kid: The Long Haul", "value": 0.6077036443209748}, {"source_idx": 489, "target_idx": 1306, "source": "Finding Nemo 3D", "target": "Finding Dory", "value": 0.7050593631497588}, {"source_idx": 496, "target_idx": 1008, "source": "For a Good Time, Call...", "target": "Blended", "value": 0.551858894050534}, {"source_idx": 521, "target_idx": 770, "source": "The Hunger Games", "target": "The Hunger Games: Catching Fire", "value": 0.7286177799040604}, {"source_idx": 521, "target_idx": 1104, "source": "The Hunger Games", "target": "The Hunger Games: Mockingjay – Part 1", "value": 0.6115563219164111}, {"source_idx": 551, "target_idx": 828, "source": "Monsters, Inc. 3D", "target": "Monsters University", "value": 0.5280664608870669}, {"source_idx": 560, "target_idx": 1089, "source": "ParaNorman", "target": "Fury", "value": 0.5244886512132519}, {"source_idx": 566, "target_idx": 1196, "source": "Pitch Perfect", "target": "Pitch Perfect 2", "value": 0.7209829154087514}, {"source_idx": 566, "target_idx": 1533, "source": "Pitch Perfect", "target": "Pitch Perfect 3", "value": 0.6557147532241252}, {"source_idx": 579, "target_idx": 1345, "source": "Resident Evil: Retribution", "target": "Resident Evil: The Final Chapter", "value": 0.5581964828989385}, {"source_idx": 583, "target_idx": 1307, "source": "Ruby Sparks", "target": "Central Intelligence", "value": 0.5311126858655291}, {"source_idx": 583, "target_idx": 1378, "source": "Ruby Sparks", "target": "Life", "value": 0.5004421553915195}, {"source_idx": 602, "target_idx": 1119, "source": "Taken 2", "target": "Taken 3", "value": 0.6218965637150435}, {"source_idx": 604, "target_idx": 1211, "source": "Ted", "target": "Ted 2", "value": 0.6668564977095841}, {"source_idx": 609, "target_idx": 1223, "source": "A Thousand Words", "target": "Room (2015 film)", "value": 0.5050646516857905}, {"source_idx": 614, "target_idx": 934, "source": "Touchback", "target": " Zero Charisma", "value": 0.5655375926110751}, {"source_idx": 616, "target_idx": 1333, "source": "Underworld: Awakening", "target": "Underworld: Blood Wars", "value": 0.6253466771551713}, {"source_idx": 632, "target_idx": 1475, "source": "21 and Over", "target": "Stronger", "value": 0.6097751372822164}, {"source_idx": 643, "target_idx": 788, "source": "American Hustle", "target": "Jackass Presents: Bad Grandpa", "value": 0.5455776301965999}, {"source_idx": 681, "target_idx": 1136, "source": "C.O.G.", "target": "Project Almanac", "value": 0.5000071325162556}, {"source_idx": 707, "target_idx": 1435, "source": "Despicable Me 2", "target": "Despicable Me 3", "value": 0.695967258729497}, {"source_idx": 722, "target_idx": 1055, "source": "Evil Dead", "target": "If I Stay", "value": 0.6537606857603799}, {"source_idx": 722, "target_idx": 1076, "source": "Evil Dead", "target": "Annabelle", "value": 0.5193002739211476}, {"source_idx": 723, "target_idx": 883, "source": "The Face of Love", "target": "Sexy Evil Genius", "value": 0.5747716225305683}, {"source_idx": 726, "target_idx": 1174, "source": "Fast & Furious 6", "target": "Furious 7", "value": 0.7526456678089223}, {"source_idx": 726, "target_idx": 1391, "source": "Fast & Furious 6", "target": "The Fate of the Furious", "value": 0.574305720626659}, {"source_idx": 758, "target_idx": 989, "source": "Haunted House, AA Haunted House", "target": "A Haunted House 2", "value": 0.6619541463047843}, {"source_idx": 759, "target_idx": 815, "source": "The Haunting in Connecticut 2: Ghosts of Georgia", "target": "Lords of Salem, The Lords of Salem", "value": 0.6170166362246392}, {"source_idx": 770, "target_idx": 1104, "source": "The Hunger Games: Catching Fire", "target": "The Hunger Games: Mockingjay – Part 1", "value": 0.7216923316241433}, {"source_idx": 772, "target_idx": 874, "source": "I Spit on Your Grave 2", "target": "Safe Haven", "value": 0.5156037989760799}, {"source_idx": 772, "target_idx": 1438, "source": "I Spit on Your Grave 2", "target": "Inconceivable", "value": 0.5003055309063249}, {"source_idx": 820, "target_idx": 833, "source": "LUV", "target": "Nebraska", "value": 0.6326995997055274}, {"source_idx": 835, "target_idx": 1305, "source": "Now You See Me", "target": "Now You See Me 2", "value": 0.5165299050120729}, {"source_idx": 839, "target_idx": 1261, "source": "Olympus Has Fallen", "target": "London Has Fallen", "value": 0.57681034289035}, {"source_idx": 856, "target_idx": 1035, "source": "Planes", "target": "Planes: Fire & Rescue", "value": 0.5694710285939523}, {"source_idx": 860, "target_idx": 957, "source": "The Pretty One", "target": "The Pretty One", "value": 1.0000000000000004}, {"source_idx": 874, "target_idx": 1438, "source": "Safe Haven", "target": "Inconceivable", "value": 0.5133262252685835}, {"source_idx": 890, "target_idx": 1386, "source": "The Smurfs 2", "target": "Smurfs: The Lost Village", "value": 0.7451477692649552}, {"source_idx": 891, "target_idx": 1386, "source": "The Smurfs: The Legend of Smurfy Hollow", "target": "Smurfs: The Lost Village", "value": 0.5000351495409133}, {"source_idx": 898, "target_idx": 1109, "source": "Stand Up Guys", "target": "Inherent Vice", "value": 0.5009819468957925}, {"source_idx": 939, "target_idx": 1040, "source": "The Legend of Hercules", "target": "Hercules", "value": 0.5370052557824199}, {"source_idx": 943, "target_idx": 1457, "source": "The Nut Job", "target": "The Nut Job 2: Nutty by Nature", "value": 0.6403214936379004}, {"source_idx": 944, "target_idx": 1238, "source": "Ride Along", "target": "Ride Along 2", "value": 0.5224850222538606}, {"source_idx": 966, "target_idx": 1162, "source": "Barefoot", "target": "It Follows", "value": 0.5475899037552829}, {"source_idx": 977, "target_idx": 1166, "source": "Divergent", "target": "The Divergent Series: Insurgent", "value": 0.6981910439410246}, {"source_idx": 989, "target_idx": 1208, "source": "A Haunted House 2", "target": "Dope", "value": 0.6119470029146366}, {"source_idx": 992, "target_idx": 1134, "source": "13 Sins", "target": "Black or White", "value": 0.5435285908124664}, {"source_idx": 992, "target_idx": 1335, "source": "13 Sins", "target": "The Bye Bye Man", "value": 0.5439781217539871}, {"source_idx": 1003, "target_idx": 1296, "source": "Neighbors", "target": "Neighbors 2: Sorority Rising", "value": 0.6660341176124711}, {"source_idx": 1030, "target_idx": 1442, "source": "Dawn of the Planet of the Apes", "target": "War for the Planet of the Apes", "value": 0.6621214683412776}, {"source_idx": 1043, "target_idx": 1402, "source": "Guardians of the Galaxy", "target": "Guardians of the Galaxy Vol. 2", "value": 0.5379173973729265}, {"source_idx": 1049, "target_idx": 1300, "source": "Teenage Mutant Nina Turtles", "target": "TMNT 2: Out of the Shadows", "value": 0.611946660977409}, {"source_idx": 1054, "target_idx": 1344, "source": "The One I Love", "target": "A Dog's Purpose", "value": 0.5162713466810889}, {"source_idx": 1055, "target_idx": 1076, "source": "If I Stay", "target": "Annabelle", "value": 0.517440801967852}, {"source_idx": 1091, "target_idx": 1148, "source": "Nightcrawler", "target": "Hot Tub Time Machine 2", "value": 0.6127222318117417}, {"source_idx": 1144, "target_idx": 1352, "source": "Fifty Shades of Grey", "target": "Fifty Shades Darker", "value": 0.8488365461262362}, {"source_idx": 1145, "target_idx": 1473, "source": "Kingsman: The Secret Service", "target": "Kingsman: The Golden Circle", "value": 0.5293263906417052}, {"source_idx": 1166, "target_idx": 1269, "source": "The Divergent Series: Insurgent", "target": "The Divergent Series: Allegiant", "value": 0.601651694919194}, {"source_idx": 1174, "target_idx": 1391, "source": "Furious 7", "target": "The Fate of the Furious", "value": 0.5968117529884799}, {"source_idx": 1196, "target_idx": 1533, "source": "Pitch Perfect 2", "target": "Pitch Perfect 3", "value": 0.6916869675792849}, {"source_idx": 1230, "target_idx": 1511, "source": "Daddy's Home", "target": "Daddy's Home 2", "value": 0.7502744844045383}, {"source_idx": 1307, "target_idx": 1378, "source": "Central Intelligence", "target": "Life", "value": 0.5509183334062436}, {"source_idx": 1401, "target_idx": 1516, "source": "Sleight", "target": "The Star", "value": 0.5058824321305131}]}